export default {
  "紫微": [
    "有王者特质, 比如有较高的控制欲和占有欲, 喜欢一些华而不实的东西, 属于要面子不要里子类型, 所以会给人距离感",
    "但因为帝星如命, 目标长远, 有很强的大局观, 好为人师",
    "紫微比较吃资源, 需要足够的条件才能发挥王者特质, 认知不到位很容易导致眼高手低或者高不成低不就",
    "因此需要拓宽知识的广度, 打好基础, 其他自然水到渠成; 还要特别注意别人的'捧杀'行为, 别在吹捧中迷失自己"
  ],
  "天机": [
    "天机代表智慧/精神, 思维活跃, 能够从别人难以发现的角度看待人事物",
    "因为过于聪明, 更喜动脑, 执行力会受到一些压制; 可以精明的知道如何带动气氛",
    "同时因为思维活跃, 所以很难静下心来深入研究某件事, 常出现知识宽度有余而深度不足的问题, 而且自己作为聪明人, 不太喜欢和脑筋反应慢的人来往",
    "因此需要静下心打磨知识的深度, 修炼自己内心, 多磨磨性子"
  ],
  "太阳": [
    "有一部分紫微的特质, 比如:希望得到尊重/好为人师等; 但比紫微要更亲和一些",
    "内心渴望权利, 喜欢争, 生活中很在意话语权, 为人处事较为强势, 会毫不犹豫的用法律维护自己的合法权利",
    "因此要注意自己的强势是否会给身边的人造成很大的压力, "
  ],
  "武曲": [
    "个性孤傲刚直, 有'独行侠'之名, 但实际上只是不善表达, 不喜社交, 常常因为直来直往的个性会在无意中中伤他人, 所以慢慢就变成了'独行侠'",
    "生活中怕麻烦别人, 怕人情世故, 因此造就了强大的动手能力和行动力, 小事绝不麻烦别人",
    "缺点是需要思维活跃的方面弱一些, 而且不太听别人劝告, 因此一定要多听别人意见, 多跳出自己的思维思考"
  ],
  "天同": [
    "父母比较强势, 从小受到的压力比较大, 得到的关怀和爱护要少一些, 所以个性温和, 逆来顺受不争不抢, 会把更多的精力放到自我享受上面, 弥补自己",
    "因为个性保守, 不太喜欢不确定或有分险的东西, 更不会孤注一掷去拼抢; 同时要懂得拒绝和断舍离, 勇敢Say No"
  ],
  "廉贞": [
    "自我保护意识较强, 不太喜欢和人交心, 所以不太精于社交及人情世故方面, 社交圈不大, 给人很强的距离感, 不太会做出迎合他人的行为",
    "对待任何事物都非常理性认真, 有时会显得高冷/死板, 同时因为特别认理可能会在无意中做出或说出一些伤害别人的事和话",
    "如果能够吃到资源, 遇到伯乐, 结合自身理性认真的特质 很容易成为行业翘楚"
  ],
  "天府": [
    "虽有帝星入命, 喜欢众星捧月的感觉, 但要低调务实许多, 不喜一些华而不实的东西, 讲究实际作用, 喜欢精神上的享受",
    "低调务实, 不争不抢只是不想, 而不是不敢; 毕竟帝星入命, 威严依旧存在; 个性和爱好广泛, 人脉较为宽广"
  ],
  "巨门": [
    "有一颗八卦之魂, 对东家长西家短的事情特别感兴趣, 同时非常热心肠, 很喜欢关心和照顾别人",
    "受四化影响较大, 巨门化权时说话非常有公信力和权威性, 滔滔雄辩, 万夫莫敌; 巨门化忌时说话会给人压迫感,容易出口伤人"
  ],
  "天相": [
    "工作生活中知人善任, 八面玲珑, 表面看起来挺强硬, 但熟悉后很随和, 做事细腻且不拘一格, 适合当组织者,各方面能力都很均衡",
    "执行力和本身亮度成正比, 亮度高执行力强, 反而会变得犹豫不决, 畏首畏尾"
  ],
  "天梁": [
    "生活中和别人相处时有很强的江湖气, 客客气气反而很别扭, 喜欢交朋友, 讲义气",
    "给人以稳重的感觉, 喜欢帮助弱小, 不太给比自己强势的人面子, 略显清高",
    "所以, 要注意交友的质量, 警惕交友不慎, 不要自己绑架自己, 对损友要及时远离"
  ],
  "七杀": [
    "生活中表现的不太友善, 让人不敢主动靠近, 而且言辞相当犀利, 沟通时对方压迫感很强",
    "执行力很强, 但往往思考不到位, 需要三思而后行, 同时性格很直, 缺乏浪漫, 而且不善处理圆滑的事情"
  ],
  "破军": [
    "有类似破釜沉舟的魄力, 敢打敢拼, 有勇有谋, 敢于打破既有规则, 所以人生比较精彩, 尤其是艺术领域, 可以长期在一个领域深耕",
    "天生自带反骨, 给人桀骜不驯的感觉, 做决定前最好多一个备份"
  ],
  "太阴": [
    "生性婉约/文艺, 喜欢安静/干净的环境, 审美眼光非常独特, 艺术天赋较高, 喜欢照顾人, 给人如沐春风的感觉",
    "心里承受能力不是特别强大, 很容易收到环境的影响; 内心喜欢浪漫, 情感丰富, 但多数时候多愁善感, 所以表现出来就是很纠结, 举棋不定, 情感方面挑战较大"
  ],
  "贪狼": [
    "生活中比较受欢迎, 各种事情都能处理的游刃有余, 社交能力很强; 对自己感兴趣的东西能够深入研究和探索, 同时能够保持好奇心和热情, 心里的念想是正向的话前途不可限量",
    "缺点是赌性特别强, 人生起伏较大, 大开大合, 但是有很强的不服输不怕输的精神, 生活中需要增强知识的广度, 避免孤注一掷给自己带来不可挽回的结果"
  ],
  "左辅": [
    "特别喜欢帮助别人, 为别人提供助力, 而且提供的助力比较明确且强势, 对方感受很明显, 同时可能会有架子, 在生活和工作中展示出领导者的角色, 不太容易接受别人的反驳, 有点偏长辈视角",
    "特别会通过周围关系提升自己的地位和影响力, 所以比较善于处理人际关系"
  ],
  "右弼": [
    "偏向于像母亲对子女一样的在背后默默付出, 而不是明确且强势的给对方提供帮助, 温柔体贴且善解人意, 善于倾听他人的需求, 并愿意给予支持和帮助",
    "立场不够坚定, 容易被别人左右, 缺少一点判断力, 有时候帮忙反而会不讨好, 但有较好的艺术修养和才气"
  ],
  "文昌": [
    "记忆力很好, 从小到大学习成绩优异, 而且多半长大后从事小时候的理想, 喜欢文学, 会给人文质彬彬的感觉, 所以即使在现在, 偏向文学和记忆型的工作都能得心应手, 别人看来可能会有点书呆子气, 比较呆板/缺乏变通",
    "如果能遇到桃花星, 就会给人风流倜傥的感觉"
  ],
  "文曲": [
    "思想很活, 善于变通, 内心比较多愁善感, 有很强的艺术修养, 但需要很强的文化底蕴才能将艺术修养发挥出来, 否则就给人感觉无病呻吟/故作深沉了",
  ],
  "天魁": [
    "有很强的领导欲望, 喜欢管人, 深谙咬文嚼字之道, 决策比较果断; 在帮助别人方面, 只解决燃眉之急, 秉持的原则就是救急不救穷 长久的解决还需要对方实力过硬或者认知能力的提高"
  ],
  "天钺": [
    "智多星的角色, 善于策划/思考和分析, 有一定的领地意识, 不喜欢别人对自己负责的事情指手画脚; 在帮助别人方面偏向直接解决问题的根源, 化麻烦于无形"
  ],
  "陀罗": [
    "遇事容易纠结, 难以果断抉择, 所以在行动上会容易拖延活错失良机, 不过一旦下定决心后做事循序渐进, 适合做一些长期的任务, 喜欢深入研究原理, 了解事情的本质和规律"
  ],
  "火星": [
    "情绪起伏很大, 开心时热情似火, 愤怒时狂风暴雨, 心里不藏事, 喜怒哀乐都会直接表现出来, 因此会显得坦诚且真实; 同时这种暴脾气会导致在决定时欠缺考虑, 容易做出冲动的选择",
  ],
  "铃星": [
    "外表看着很内敛, 但是负能量会积压在心里慢慢释放, 处理事情非常冷静和克制, 不过要小心情绪积压过多导致的心理问题, 要找到自己疏通和排解情绪的方法, 以维持心理的健康",
    "善于精打细算, 做事思虑周全, 会有条不紊的安排好生活的方方面面, 给人很可靠的感觉, 整体偏保守, 需要突破自己, 适当冒险以获得更多的成长和回报"
  ],
  "地空": [
    "善于思考, 脑子里想法特别多, 在艺术创作和文案策划方面有较高的天赋, 但是在实际执行时怕麻烦, 一旦事情比较繁琐就会容易选择逃避, 所以没有能够长久坚持的事情"
  ],
  "地劫": [
    "典型的风险厌恶型, 不太会把握机会, 而且比较挑剔, 即使很好的机会也会犹豫再三, 最终错过最佳时机; 喜欢短平快的节奏, 不会去做长期主义的事情, 所以很容易陷入博而不精的状况之中, 需要强化规划方面的能力, 并督促自己按部就班的完成"
  ],
  "擎羊": [
    "典型的行动派, 行动和执行力很强而且很果断, 即使遇到较大的困难也能迅速做出决策并付诸行动 ",
    "缺点是思考不足, 非常容易冲动行事, 因此可能会造成不可挽回的结果",
    "非常注重自己的行动和目标, 不太在意别人的看法和期待, 喜欢按照自己的方式和节奏生活, 略显异类, 但这也赋予了独特的个性和魅力"
  ],
  "天马": [
    "精力旺盛, 充满活力, 喜欢追求刺激和变化, 喜欢尝试新鲜事物, 有很高的冒险精神, 不愿受到束缚和限制",
    "生活很积极, 会主动追求内心的目标, 渴望探索未知, 因此更容易发现成功的机会, 但是坚持和沉淀能力不足, 很难在一个深耕行业"
  ],
  "禄存": [
    "家庭条件很优渥, 而且个性谨慎/保守, 能受得住家财, 同时避免很多经济上的损失, 但也会错失很多很好的机会"
  ],
}
