export default {
  "命宫": {
    'desc': '命宫乃本命所在之宫，为先天运势、命运的主轴、行运的源头。象征多方面。代表人格的正、负特质与潜在的思想观念。诸如财富、地位、相貌、个性、才能、疾病、脾气、性情、特质、家世等，甚至一生之境遇与成败关键，都可命宫推之',
    '紫微': {
      'desc': [
        '面貌敦厚，举止高雅，待人谦恭有礼、做事小心谨慎、从容不迫，拥强烈的好奇心与卓越的管理能力',
        '个性方面，喜占权，爱发号施令。较耳跟软，也比较无情',
        '爱结交权贵，骄傲，喜欢奉承（或被奉承）, 通才但不专才，但对文章则有造诣'
      ],
      '权': '能力强，大权在握，若会左辅右弼，局面更大',
      '禄': '',
      '科': '贵人，此科有解厄之功，而紫微也才能发挥解厄之力',
      '忌': '',
    },
    '天机': {
      'desc': [
        '个性温和、待人客气，又好行善，且具他人所不能的领悟力与研究心，所以人缘很好，深受他人欢迎',
        '反应敏捷、智商高又富洞悉力，拥卓越的事业策划天才和他人所无的独创见、构想，所以非常适合造福人群的工作',
        '常会玩一些小聪明, 需要把握尺度，否则很容易惹得别人讨厌'
      ],
      '权': '谋略，精打细算，能干',
      '禄': '聪明，热爱宗教',
      '科': '智慧，聪明善动脑筋，为企划高手',
      '忌': '天性聪颖，忌会钻牛角尖多疑，固执不通',
    },
    '太阳': {
      'desc': [
        '面貌丰满，体格魁梧，个性豪爽，秉性仁厚，好恶分明，为一敢爱敢恨的人',
        '待人更具热忱，所以受友人敬重，是一风头人物',
        '职业方面，一般说来以能独当一面的工作性质最佳，如：政治家、木匠、土木工程师等'
      ],
      '权': '刚强，创业，固执，好表现，求胜心强',
      '禄': '有老板格，主管格',
      '科': '',
      '忌': '不利男命主劳禄，太阳过于鸡婆，忌会使性子，耍脾气，不得人缘',
    },
    '武曲': {
      'desc': [
        '一生有财运，但性情刚烈孤克, 有宜男不宜女之说，主要指感情方面',
        '在婚姻方面却会比较有波折，但若能力争上游、辛勤持俭，中年以后，必可大吉大利大发财，并且还是为数相当可观的财产',
        '个性稍微嫌急躁, 少年时比较困苦，步入中年以后则万事享通'
      ],
      '权': '有独当一面，独挑大梁之才，故而往武职方面发展最为合宜',
      '禄': '为正财，个性刚强，有赚钱头脑。从商者可大吉大利、大富大贵',
      '科': '文学素养，倘往文学方面研究、发展，可望功成名就',
      '忌': '一生充满荆棘，问题枝节横生，产生诸多不顺的影响',
    },
    '天同': {
      'desc': [
        '身材丰腴、性情温和、朝气蓬勃、彬彬有礼、文墨兼通，是一懂得生活享受，明白生活情趣的人，故而心情较常人稳定',
        '缺点是没有耐性，凡事都喜好学习，研究，但往往无法持之以恒，造成博而不精的情形',
        '有与众不同的艺术智商，所以职业以运用这方面智商的工作最佳，如：商业上的交涉、饮食业的经营等'
      ],
      '权': '能激发干劲',
      '禄': '解厄福气好，然过于懒散',
      '科': '',
      '忌': '善协调，忌会造成人缘不佳，工作懒散，行运逢之，会错失机会',
    },
    '廉贞': {
      'desc': [
        '身体强壮，个性倔强，性情急躁，做事往往随兴所至，一意孤行，但仍拥有不屈不挠、勤奋努力的精神',
        "自我保护意识较强, 不太喜欢和人交心, 所以不太精于社交及人情世故方面, 社交圈不大, 给人很强的距离感, 不太会做出迎合他人的行为",
        "对待任何事物都非常理性认真, 有时会显得高冷/死板, 同时因为特别认理可能会在无意中做出或说出一些伤害别人的事和话",
      ],
      '权': '',
      '禄': '有领导能力，可使人服从与支持，做事顺利，又主桃花，行限逢之，烦恼可解，爱情顺利，然逢煞主感情纠纷',
      '科': '',
      '忌': '感情方面会有坎坷，为情伤身，大限流年遇到，注意官司是非',
    },
    '天府': {
      'desc': [
        '温文儒雅，多才多艺，心胸开阔，是一优秀型的人，但易流于怠惰，所以没有发展人生，开创人生的热诚与冲劲',
        "低调务实, 不争不抢只是不想, 而不是不敢; 毕竟帝星入命, 威严依旧存在; 个性和爱好广泛, 人脉较为宽广",
        '职业方面：适合单纯的工作环境，比如公务员、有一技之长或自己当老板'
      ],
      '权': '',
      '禄': '',
      '科': '',
      '忌': '',
    },
    '太阴': {
      'desc': [
        '面貌脱俗，五官端正，轮廓优美，心性温和，博学多能，且天生浪漫，故而全身散发着一令人难以抵抗的魅力',
        "但因过于追求浪漫，过于期待美妙的人生，所以往往对自己造成严重伤害，因而造成了逃避现实的弱点",
      ],
      '权': '男主好享受，自得其乐。女主能交际，有才能',
      '禄': '财库、安逸，但抗压性不足',
      '科': '长相清秀，文采丰富，男命会带有脂粉气',
      '忌': '不利女命，劳多获少，会吃暗亏',
    },
    '贪狼': {
      'desc': [
        '占有欲强，喜爱变化，所以给人世故圆滑的感觉',
        "爱享受，多嗜好，尤其是赌博、酒、色方面，更是嗜之如命",
      ],
      '权': '能干，有作为，有辩才，可掌权',
      '禄': '桃花又主聪明，有偏财运，然会过于投机',
      '科': '',
      '忌': '流于空想不切实际，然贪狼忌喜玄学，适合研究命理五术。贪狼星为桃花星，行运逢之防桃花损财或花柳之疾',
    },
    '巨门': {
      'desc': [
        '有一颗八卦之魂, 对东家长西家短的事情特别感兴趣, 同时非常热心肠, 很喜欢关心和照顾别人',
        "能言善道，但所说的并非毫无根据的胡言乱语，而是些有内容、有深度、有条理的至理名言",
        '主观强烈，心机深沉，疑心病重，且性情冷酷，所以容易变成一位短视之人，除非勤勉奋斗，否则无成功希望可言'
      ],
      '权': '动则有利，开口得财，唯得理不饶人，需留人方寸地',
      '禄': '口才好与文昌或文曲同宫主桃花',
      '科': '',
      '忌': '爱管闲事，人事是非，家庭是非难免，容易招致官司是非口舌',
    },
    '天相': {
      'desc': [
        '为人敦厚，性情温和，待人诚实，行事小心具正义感，并且稳重而又乐善好施',
        "辛劳命，成功要考一分耕耘，一分收获得来",
      ],
      '权': '',
      '禄': '',
      '科': '',
      '忌': '',
    },
    '天梁': {
      'desc': [
        '相貌清秀，头脑聪明，性情耿直，心地和善，凡事讲求义、理，永远站在「理」字之上行事，所以能普遍受大众欢迎，居领导的地位',
        "生活中和别人相处时有很强的江湖气, 客客气气反而很别扭, 喜欢交朋友, 讲义气",
        "所以, 要注意交友的质量, 警惕交友不慎, 不要自己绑架自己, 对损友要及时远离",
      ],
      '权': '喜掌权，喜管他人事，好打抱不平，讲义气',
      '禄': '可解灾厄，又主福寿',
      '科': '宜从事研究，及深奥理论之行业，但莫杂而不精，否则会有言过其实之感，行运逢之，得长辈之助',
      '忌': '',
    },
    '七杀': {
      'desc': [
        '个性独立，志得意满，自尊心强，又不喜听令于人，所以常常导致情绪的喜怒无常，阴晴不定',
        "亦有执着、忍耐的一面，所以不致与人结怨，树立敌人",
        "好胜心强，所以常不能忍受失败的打击，有时会因一次的挫败，而一蹙不振，堕落下去",
      ],
      '权': '',
      '禄': '',
      '科': '',
      '忌': '',
    },
    '破军': {
      'desc': [
        '性情刚烈，个性豪迈，江湖味浓，得罪人而不自知，为朋友两肋插刀而不辨善恶',
        "需背井背井，较能崭露才华、发光发亮，功成名就",
        "有类似破釜沉舟的魄力, 敢打敢拼, 有勇有谋, 敢于打破既有规则, 所以人生比较精彩, 尤其是艺术领域, 可以长期在一个领域深耕",
      ],
      '权': '驿马，入寅申巳亥四马地主变动',
      '禄': '变动，财运感情如意',
      '科': '',
      '忌': '',
    },
    '左辅': {
      'desc': [
        '为人忠诚敦厚，得人钦重, 若得紫微、科、权会照，无论是从业文职或武职，均能大富大贵，财官双美',
      ],
      '权': '',
      '禄': '',
      '科': '明贵人，明的帮忙，直接扶助，行运逢之，主解厄',
      '忌': '',
    }, // https://www.ziwei.my/palace-life/zwds-stars-at-life-palace-note-1/
    '右弼': {
      'desc': [
        '为人忠诚敦厚，心怀耿宜，宽恕待人，做事有计画，先谋而后能动',
      ],
      '权': '',
      '禄': '',
      '科': '暗贵人，非亲近的贵人，行运逢之，主解厄',
      '忌': '',
    },
    '文昌': {
      'desc': [
        '记忆力很好, 从小到大学习成绩优异, 而且多半长大后从事小时候的理想, 喜欢文学, 会给人文质彬彬的感觉, 所以即使在现在, 偏向文学和记忆型的工作都能得心应手, 别人看来可能会有点书呆子气, 比较呆板/缺乏变通',
        '如果能遇到桃花星, 就会给人风流倜傥的感觉'
      ],
      '权': '',
      '禄': '',
      '科': '才学佳，智慧高，多才多艺，行运逢之，可解厄',
      '忌': '会造成得理不饶人，恃才傲物, 而且行运逢之，注意票据作保问题',
    },
    '文曲': {
      'desc': [
        '思想很活, 善于变通, 内心比较多愁善感, 有很强的艺术修养, 但需要很强的文化底蕴才能将艺术修养发挥出来, 否则就给人感觉无病呻吟/故作深沉了',
      ],
      '权': '',
      '禄': '',
      '科': '才学佳，偏向文艺气息之才学，如艺术音乐等，行运逢之，可解厄',
      '忌': '本身有才华，然忌会造成语言低俗，感情表达词不达意，让人误解',
    },
    '天魁': {
      'desc': [
        '头脑聪明，待人和气又具威严，是一运势强盛的人，所以凡事都可转危为安，转祸为福',
        '可得贵人之助，逢凶化吉，顺遂一生, 成就与困境是成正比，往往所遭遇的困难越多，成就就愈可观、愈飞黄腾达'
      ],
        '权': '',
          '禄': '',
            '科': '',
              '忌': '',
    },
    '天钺': {
      'desc': [
        '智多星的角色, 善于策划/思考和分析, 有一定的领地意识, 不喜欢别人对自己负责的事情指手画脚; 在帮助别人方面偏向直接解决问题的根源, 化麻烦于无形',
      ],
        '权': '',
          '禄': '',
            '科': '',
              '忌': '',
    },
    '擎羊': {
      'desc': [
        "典型的行动派, 行动和执行力很强而且很果断, 即使遇到较大的困难也能迅速做出决策并付诸行动 ",
        "缺点是思考不足, 非常容易冲动行事, 因此可能会造成不可挽回的结果",
        "非常注重自己的行动和目标, 不太在意别人的看法和期待, 喜欢按照自己的方式和节奏生活, 略显异类, 但这也赋予了独特的个性和魅力"
      ],
        '权': '',
          '禄': '',
            '科': '',
              '忌': '',
    },
    '陀罗': {
      'desc': [
        "遇事容易纠结, 难以果断抉择, 所以在行动上会容易拖延活错失良机, 事业、婚姻较一般人晚",
        '喜欢深入研究原理, 了解事情的本质和规律, 做一些长期的任务'
      ],
        '权': '',
          '禄': '',
            '科': '',
              '忌': '',
    },
    '火星': {
      'desc': [
        "情绪起伏很大, 开心时热情似火, 愤怒时狂风暴雨, 心里不藏事, 喜怒哀乐都会直接表现出来, 因此会显得坦诚且真实; 同时这种暴脾气会导致在决定时欠缺考虑, 容易做出冲动的选择",
        '如遇贪狼同宫, 从事武职军官的话，必可为国立功'
      ],
        '权': '',
          '禄': '',
            '科': '',
              '忌': '',
    },
    '铃星': {
      'desc': [
        "外表看着很内敛, 但是负能量会积压在心里慢慢释放, 处理事情非常冷静和克制, 不过要小心情绪积压过多导致的心理问题, 要找到自己疏通和排解情绪的方法, 以维持心理的健康",
        "善于精打细算, 做事思虑周全, 会有条不紊的安排好生活的方方面面, 给人很可靠的感觉, 整体偏保守, 需要突破自己, 适当冒险以获得更多的成长和回报",
        '如遇贪狼同宫，可身居高位，财源不断，获财官双全之美'
      ],
        '权': '',
          '禄': '',
            '科': '',
              '忌': '',
    },
    '地空': {
      'desc': [
        "善于思考, 脑子里想法特别多, 在艺术创作和文案策划方面有较高的天赋, 但是在实际执行时怕麻烦, 一旦事情比较繁琐就会容易选择逃避, 所以没有能够长久坚持的事情",
        "地空主破财，故而凡有地空坐命者，须加以提防以免破财，而提防的最好方法，就是节流，以避损失",
      ],
        '权': '',
          '禄': '',
            '科': '',
              '忌': '',
    },
    '地劫': {
      'desc': [
        "头脑聪颖、反应灵敏、有自己的思想及人生观，可惜喜好投机，因此常走旁门邪道，以致遭到许多的是是非非，使精神、物质双方面均倍受困扰、打击",
      ],
        '权': '',
          '禄': '',
            '科': '',
              '忌': '',
    },
    '天马': {
      'desc': [
        '精力旺盛, 充满活力, 喜欢追求刺激和变化, 喜欢尝试新鲜事物, 有很高的冒险精神, 不愿受到束缚和限制',
        '离乡背井，出外奋斗，对天马而言是一成功的先决条件, 因此适合出外谋生，求取成功',
      ],
        '权': '',
          '禄': '',
            '科': '',
              '忌': '',
    },
    '禄存': {
      'desc': [
        '面貌清秀、聪明伶俐、秉性善良，且一生财源不断，个性谨慎, 是一勤俭的人。若不将钱财视如生命般的重要，亦不执着、吝惜，必可一生顺遂，无忧无虑',
      ],
        '权': '',
          '禄': '',
            '科': '',
              '忌': '',
    },
  },
  '兄弟': {
    'desc': '兄弟宫主有无兄弟，个性，和睦与否，相处态度，互动关系，缘分如何，未来成就发展如何，助力与否，有否夭折。朋友或事业合伙关系。乃推断命造和兄弟姊妹的缘份、关系、感情如何',
    '紫微': {
      'desc': [
        '兄弟姊妹中必有一人足以倚靠, 无论在物质方面或精神方面都是丰收的, 但如遇杀破狼同宫, 主兄弟助益小, 志向各异, 面和心不合',
      ],
        '权': '兄弟有权威',
        '禄': '',
        '科': '兄弟很会关心你',
        '忌': '',
    },
    '天机': {
      'desc': [
        '兄弟姊妹中必有一人以上对学术研究有兴趣而且在这方面有所成就',
      ],
        '权': '兄弟易有变迁',
        '禄': '兄弟聪明有智慧',
        '科': '兄弟可教导',
        '忌': '兄弟之间缘分浅薄',
    },
    '太阳': {
      'desc': [
        '多半兄弟姊妹间来往频繁, 必有人在交际、社会应对方面的关系良好，可助自己一臂之力',
      ],
        '权': '兄弟喜出风头',
        '禄': '若与人合伙，没有实权',
        '科': '',
        '忌': '兄弟有损，不主姊妹，会和兄弟朋友有债务或人事纠纷',
    },
    '武曲': {
      'desc': [
        '最多只有一个兄弟，而且兄弟姊妹间的感情不会很好, 而且性格较为激烈，常有自己的做法和看法，不能团结形成一股比较大的力量，兄弟之间孤军奋战',
      ],
        '权': '兄弟姊妹喜掌权',
        '禄': '兄弟个性强，而且会赚钱',
        '科': '会得到兄弟帮助',
        '忌': '兄弟姊妹有损，或有宗教缘',
    },
    '天同': {
      'desc': [
        '和兄弟姊妹相处得很好，能托他们的福，得到他们的帮助',
      ],
        '权': '兄弟姊妹懒散，互推责任',
        '禄': '兄弟和谐',
        '科': '',
        '忌': '兄弟不和谐',
    },
    '廉贞': {
      'desc': [
        '兄弟姊妹间的情怠时起时沉，主要因为彼此个性都太富于变化性的缘故',
        '廉贞星在兄弟宫独坐又入庙的话，兄弟姊妹能助您一臂之力，如果独坐又落陷的话，则兄弟姊妹需要您的帮助'
      ],
        '权': '',
        '禄': '有暗桃花，得异性朋友之助',
        '科': '',
        '忌': '易交损友，或犯桃花',
    },
    '天府': {
      'desc': [
        '在少子化的当代, 兄弟姊妹较多, 而且兄弟姊妹都具有宽宏的度量，擅长于交际，在社会上知名度较高',
      ],
        '权': '',
          '禄': '有暗桃花，得异性朋友之助',
            '科': '',
              '忌': '易交损友，或犯桃花',
    },
    '太阴': {
      'desc': [
        '和兄弟姊妹的缘分很厚，通常不会太早分家，兄弟姊妹间有长于文与、艺术者，在社会上非常的突出',
      ],
        '权': '姊妹掌权',
        '禄': '姊妹缘深',
        '科': '姊妹情深',
        '忌': '姊妹有损，或与女性朋友有债务及人事纠纷',
    },
    '贪狼': {
      'desc': [
        '兄弟姊妹很少，如果在宫内落陷的话，则可能有同父异母的兄弟，外表非常出众',
      ],
        '权': '兄弟姊妹固执霸道',
        '禄': '有暗财、偏财',
        '科': '',
        '忌': '兄弟姊妹感情多波折，或精通五术',
    },
    '巨门': {
      'desc': [
        '兄弟姊妹相处得不太好，也无法由兄弟姊妹之处得到任何的助益',
      ],
        '权': '兄弟口才好，滔滔雄辩',
        '禄': '喜欢结交朋友',
        '科': '',
        '忌': '易与兄弟朋友有口舌纠纷',
    },
    '天相': {
      'desc': [
        '兄弟姊妹间有很深厚的友情，兄友弟恭，彼此在课业上或长大后在事业上都能相互的提携和支持',
      ],
        '权': '',
          '禄': '',
            '科': '',
              '忌': '',
    },
    '天梁': {
      'desc': [
        '如果兄弟的人数在三人以下的话，彼此间会相处得很好，从小到大都一直是最亲密的伙伴，但若兄弟的人数在三人以上的话，彼此间都无法推心置腹',
      ],
        '权': '较听兄姐的话，也主兄姐口才好',
        '禄': '得兄弟朋友的照顾，但有时后也会有被兄弟朋友拘束的感觉',
        '科': '较容易得到兄姐关心',
        '忌': '',
    },
    '七杀': {
      'desc': [
        '兄弟姊妹间的缘分淡薄',
      ],
        '权': '',
          '禄': '',
            '科': '',
              '忌': '',
    },
    '破军': {
      'desc': [
        '兄弟姊妹的缘分也是比较淡薄一些，不容易和弟兄们打成一片，成功多在外地',
      ],
        '权': '兄弟朋友会出现发号司令的人',
        '禄': '在社会上能与兄弟朋友互相照应',
            '科': '',
              '忌': '',
    },
    '左辅': {
      'desc': [
        '有堪称聪明的兄弟姊妹，弟兄姊妹间的感情不错，即使成年分家之后，仍能时时给予您一臂之助力',
      ],
        '权': '',
        '禄': '',
        '科': '兄弟之间很团结',
        '忌': '',
    },
    '右弼': {
      'desc': [
        '弟兄姊妹与您都相处得不错，兄弟中多存有上进之心，能互相激励而有所成',
      ],
        '权': '',
          '禄': '',
            '科': '兄弟之间很团结',
              '忌': '',
    },
    '文昌': {
      'desc': [
        '兄弟姊妹中有以文学和才艺而闻名的，能在精神方面为大家带来愉快而平安的心境',
        '兄弟姊妹间的感情非常要好，在精神实质上紧紧的相连'
      ],
        '权': '',
        '禄': '',
        '科': '会得到兄弟朋友金钱帮助',
        '忌': '易和兄弟朋友间有金钱财产纠纷',
    },
    '文曲': {
      'desc': [
        '无论兄弟或朋友都是你快乐的泉源，唯有和自己的兄弟在一起，才能让你的思想得到自由的交流，兄弟姊妹对你有很大的帮助',
      ],
        '权': '',
          '禄': '',
        '科': '会得到兄弟朋友金钱帮助',
        '忌': '易和兄弟朋友间有金钱财产纠纷',
    },
    '天魁': {
      'desc': [
        '兄弟中有得高成就者',
      ],
        '权': '',
          '禄': '',
            '科': '',
              '忌': '',
    },
    '天钺': {
      'desc': [
        '兄弟姊妹中有贵者在其内',
      ],
        '权': '',
          '禄': '',
            '科': '',
              '忌': '',
    },
    '擎羊': {
      'desc': [
        '兄弟姊妹之间观念冲突较大, 彼此之间面和心不和',
      ],
    },
    '陀罗': {
      'desc': [
        '多与个性强烈的人做兄弟，也就是因此而造成在日常生活上的冲突时起',
      ],
    },
    '火星': {
      'desc': [
        '多主和弟兄姊妹不合，性情过于激烈造成大家彼此的疏远，以不见面为上策。自然冷淡了兄弟姊妹间的情谊',
      ],
    },
    '铃星': {
      'desc': [
        '容易和兄弟姊妹发生争执和意见上的对立，而冲淡了原有的亲情',
      ],
    },
    '地空': {
      'desc': [
        '和兄弟姊妹没有丝毫瓜葛，根本就无视于兄弟姊妹的存在，喜欢独断独行。所谓有即是无、无即是有，完全在于自己的想法和做法，也不必太在意于兄弟姊妹的帮助与否',
      ],
    },
    '地劫': {
      'desc': [
        '与兄弟姊妹亦无特殊的情分存在，甚至兄弟姊妹在您心中的地位还不如朋友，也因此手足之间没有深厚的情感，又应验了有即无、无即有的哲理',
      ],
    },
    '天马': {
      'desc': [
        '由于兄弟姊妹活动的频繁，彼此间没有很深刻的情谊，主要是因为大家都热中于向外的活动，而忽略了和兄弟姊妹的内部交流',
      ],
    },
    '禄存': {
      'desc': [
        '少有兄弟，多为独子',
      ],
    },
  },
  '夫妻': {
    'desc': '夫妻宮主夫妻之间的感情、相处模式、个性、缘份、长相、体形、出身背景、宜早婚或晚婚、婚姻生活状况、有无生离死别、另一半配偶的能力及发展如何。乃推论命造配偶之间的缘份、关系、感情如何',
    '紫微': {
      'desc': [
        '男性，会娶到一个贤淑的妻子，共度一生。女性，会嫁一个显赫丈夫，以夫为贵',
      ],
        '权': '事业家庭环境良好，配偶有实权',
        '禄': '',
        '科': '事业家庭环境良好，配偶体贴',
        '忌': '',
    },
    '天机': {
      'desc': [
        '多属早婚型，男性宜取个性刚烈之女为妻，才能和自己配合, 女性会嫁给学术上颇有成就的男性，男方的年纪愈大，对您愈有利',
      ],
        '权': '',
        '禄': '在工作环境中容易得到异性同事帮助',
        '科': '在工作环境中容易得到异性同事青睐',
        '忌': '对感情钻牛角尖，夫妻有心结，沟通问题',
    },
    '太阳': {
      'desc': [
        '配偶都是非常有力量和才干的人，就男性而言，您的妻子事业之成功可能凌驾于您之上',
        '就女性而言，会嫁一个专制独裁的丈夫，但却很有才华，因此综合起来说，还是正分比负分多一点',
        '适宜晚婚，否则的话，和配偶间有刑克的事件产生，可能一结婚就会分开到外地去出差，或与丈夫的家人不合等情事发'
      ],
        '权': '配偶能干掌权，男命需防意见不合影响婚姻',
        '禄': '男得配偶之助有机会成就自己事业，女指当老板娘机会高',
        '科': '',
        '忌': '女命不利婚姻，男命夫妻宫冲事业宫不利创业',
    },
    '武曲': {
      'desc': [
        '夫妻双方性质刚烈，日常生活中容易因为一些琐事拌嘴, 适宜晚婚, 给时间线让彼此成长起来',
        '男性而言，会娶到一个独立性很强、个性很烈的妻子；就女性而言，会嫁一个性性专断的先生，彼此虽然生活在一起，但若不相互体谅，就较容易发生各说各的，各做各的情形',
      ],
        '权': '配偶强势，男恐惧内',
        '禄': '配偶个性强，能力高',
        '科': '配偶能力强体贴',
        '忌': '孤寡，最忌忌入夫妻宫，对感情过于执着强势，会有晚婚，不婚之事',
    },
    '天同': {
      'desc': [
        '如果是男性会得到贤内助，一生因妻子的帮助而平步青云，而女性会嫁给一个个性温和的丈夫，夫妻感情和睦',
        '男性以晚婚为宜，但宜娶年轻女性为妻，女性也以迟婚为佳',
      ],
        '权': '配偶懂得享受',
        '禄': '对您的工作事业有帮助',
        '科': '',
        '忌': '夫妻感情不协调',
    },
    '廉贞': {
      'desc': [
        '恋爱过程也许是以多彩多姿闻名，但婚姻生活并不美满，配偶间离多于合',
        '廉贞星若在宫内落陷的话，男性对妻子常不知爱惜而加以凌虐，女性则克其夫，丈夫因此事业不顺或精神不畅',
      ],
        '权': '',
        '禄': '配偶长的好看，有异性缘',
        '科': '',
        '忌': '感情不顺，婚姻多波冲事业亦惹官非',
    },
    '天府': {
      'desc': [
        '如果是男性会娶到一个温柔的女性为妻，女性则嫁一个体贴的丈夫',
        '夫妻间如胶似漆，一刻也不能分离，在他们的想法中，精神要比物质来得更重要',
      ],
    },
    '太阴': {
      'desc': [
        '配偶大都比较内向',
      ],
        '权': '配偶能干，积极创业',
        '禄': '',
        '科': '配偶温柔体贴',
        '忌': '男命不利婚姻，女命无力创业或易嫁离过婚男人',
    },
    '贪狼': {
      'desc': [
        '男性比较容易被活泼开放的女性所吸引，感情较不稳定，有见异思迁的倾向，女性则性情不定易受欢场中的老手所吸引，喜欢听些不实际的话，到头来吃亏的仍是自己',
        '最好是年长一点再结婚，比较能避免这种情况'
      ],
        '权': '恋爱时配偶较主动',
        '禄': '配偶及本人都有异性缘',
        '科': '配偶温柔体贴',
        '忌': '桃花是非多，或床第不协调，配偶宜学五术',
    },
    '巨门': {
      'desc': [
        '对异性的态度包装着一股非常强烈的占有欲，因此产生嫉妒的心理，情感非常激烈，常和对方发生口角，这种打是情骂是爱的说辞常无法为对方所接受',
        '女性适合嫁给年纪较大的人，不宜同年龄的婚配，否则夫妻间争吵不断',
        '男性比较喜欢艳丽照人的女性，女性则喜欢与富家子弟结合'
      ],
        '权': '配偶口才犀利，必须相让否则婚姻易生风波',
        '禄': '无论男女皆适合当情人，然家庭责任不足',
        '科': '',
        '忌': '夫妻意见不合，冲事业易惹人事纠纷',
    },
    '天相': {
      'desc': [
        '结婚的对象大半是同学、同事或由介绍得来',
        '男性而言妻子五官品貌端正，完全依赖您，事事依您的意见, 女性而言，您的丈夫使事认真而积极，很有责任感和同情心，喜欢帮助一大堆的朋友',
      ],
    },
    '天梁': {
      'desc': [
        '比较喜欢受其配偶的拘束, 男性会娶年长于自己的女性，但容貌美丽',
        '男性而言，家里的一切大权都操在妻子的手中，就女性而言，家里的一切琐事都要受到丈夫的干涉',
      ],
        '权': '配偶喜掌权，能说善道',
        '禄': '配偶多荫，男容易得老婆娘家之助，女在工作事业容易得异性长辈关爱',
        '科': '配偶喜掌权，但会尊重另一半意见',
        '忌': '',
    },
    '七杀': {
      'desc': [
        '在感情生活方面都非常的不顺利, 夫妻双方均为性格刚烈、性情易变之人，无法避免双方的刑克，因此过着很不愉快的婚姻生活, 因此要克制自己不要在冲动下结婚，可以免除部分烦恼，因此以晚婚为佳',
      ],
    },
    '破军': {
      'desc': [
        '没有正常婚姻的观念，不喜欢设定的婚姻关系，而追求一种没有约束的感情生涯，因此如果早婚的话都带给配偶很大的伤害，最后以生死离别的悲剧来结束，晚婚较佳',
      ],
        '权': '配偶为事业奔波操劳',
        '禄': '情史丰富, 恋情精彩，晚婚为宜',
    },
    '左辅': {
      'desc': [
        '对感情之事有超脱现实的想法，为追求自己的理想而不惜抛开一切顾忌，因此就伴侣而言心里会一直揪着心, 随时可能发生危险',
        '男性而言，家里的一切大权都操在妻子的手中，就女性而言，家里的一切琐事都要受到丈夫的干涉',
      ],
        '科': '配偶注重生活情趣，需注意夫妻性生活是否协调',
    },
    '右弼': {
      'desc': [
        '喜爱过着多彩多姿、富变化性的感情生活，一旦落入平静规则化之后，即思求去，造成另外一半的痛苦，为社会凭添不少的怨偶',
      ],
        '权': '',
        '禄': '',
        '科': '配偶注重生活情趣，需注意夫妻性生活是否协调',
        '忌': '',
    },
    '文昌': {
      'desc': [
        '对异性有吸引力，这不是外貌的吸引而是一种自然的特质散发出来的引力',
        '男性与娇小的女性有缘, 女性比较会和聪明而带有书卷气息的男性结合'
      ],
        '权': '',
        '禄': '',
        '科': '配偶有文学气息',
        '忌': '配偶喜追根究底，易产生劳燕双飞之事',
    },
    '文曲': {
      'desc': [
        '对情感之事特别敏锐，容易发生一见钟情之事',
        '男性与娇小的女性有缘, 女性比较会和聪明而带有书卷气息的男性结合'
      ],
        '权': '',
        '禄': '',
        '科': '配偶有文学气息',
        '忌': '夫妻兼有桃花问题，冲事业注意金钱平衡',
    },
    '天魁': {
      'desc': [
        '很早就有感情的表现，在年少时即与异性有缘',
        '夫妻多是郎才女貌，恰似一对金童玉女'
      ],
    },
    '天钺': {
      'desc': [
        '与异性有缘，甚至到中年以后，仍会发生感情事故',
        '配偶以有良好教养者居多，而且外表非常出色'
      ],
    },
    '擎羊': {
      'desc': [
        '无论男女都易和性格刚烈的人为偶，稍一不慎就流露出固执的特性，恋爱时往往不易被察觉，一旦透过结婚的程序，原形毕露之后，问题就一箩筐、一箩筐地出现了',
      ],
    },
    '陀罗': {
      'desc': [
        '必须要慎重的选择对象来交往，否则的话只是徒劳其功，恋爱时波折重重，婚后也不见得幸福',
      ],
    },
    '火星': {
      'desc': [
        '适合晚婚，如果早婚的话，夫妻间的缘分变薄，可能无法白头偕老',
      ],
    },
    '铃星': {
      'desc': [
        '铃星如果独坐的话，表示与配偶白头偕老',
      ],
    },
    '地空': {
      'desc': [
        '配偶之间如果能存着爱不一定要拥有对方的信念，可能会过得快乐些，不要有所期待，只有尽量付出才能有一些回收',
      ],
},
    '地劫': {
      'desc': [
        '夫妻感情很坎坷, 貌合神离，因为即使结婚也无法将配偶的心拉到身边',
      ],
    },
    '天马': {
      'desc': [
        '男性一定能娶得一个贤淑的女性，能帮助丈夫创业，对丈夫的事业产生很大的助益力; 女性表示有帮夫运，也能做一个模范的母亲',
      ],
    },
    '禄存': {
      'desc': [
        '配偶能在精神方面或物质方面帮助您成功，夫妻间的感情非常好，家庭美满而快乐',
      ],
    },
  },
  '子女': {
    'desc': '子女宫主有无子嗣、好坏、资质优劣、个性、才华、健康、夭折、流产，是否孝顺等。对子女的态度，子女与自己的缘份如何，成就高低，成长中的过程如何。也象征性能力与性生活状况，也可透露出个人的生育能力',
    '紫微': {
      'desc': [
        '拥有优异的子女，才能奇特，有特殊的感应力',
      ],
        '权': '子女喜欢掌权',
          '禄': '',
            '科': '生贵子',
              '忌': '',
    },
    '天机': {
      'desc': [
        '儿女们以聪明为特征，而且拥有出色的外',
      ],
        '权': '子女机敏，善察言观色',
          '禄': '子女活泼好动，有智慧',
            '科': '子女口才好，适教职',
              '忌': '子女好动，需防意外',
    },
    '太阳': {
      'desc': [
        '子女活动力非常强，家庭内充满活泼的朝气，子女们喜欢运动也会对您的健康大有帮助，家庭气氛很开放',
      ],
        '权': '子女可成为好帮手',
          '禄': '子女对您的工作事业有帮助',
            '科': '',
              '忌': '为儿子操劳',
    },
    '武曲': {
      'desc': [
        '子女个性非常好强而固执，有自己的主见，不愿为人所左右，做事也没有弹性，说一不二，因此父子、母女间的情分淡薄，多各自坚持己见而形成意见的对立',
        '不会有很多的子女，以一个占大多数, 但非发妻所生之子女则不限于一'
      ],
        '权': '子女个性正直刚强',
          '禄': '子女聪明倔强，有生意头脑',
            '科': '子女有经济概念',
              '忌': '受孕有阻，防流产',
    },
    '天同': {
      'desc': [
        '子女们个性都非常的温顺，很听父母的话，但行动力方面有欠缺',
      ],
        '权': '子女喜欢享乐',
          '禄': '容易生下健康宝宝的子女',
            '科': '',
              '忌': '本人或子女喜劳禄',
    },
    '廉贞': {
      'desc': [
        '子女会给您带来很多困扰，例如在学校与同学的争吵闹事，狐群狗党结伴而行等，从小起就成为父母亲烦恼的根源',
        '子女个性大多是急性子, 以朋友为重，将父母摆在后面，不必过份伤心，顺其自然即可'
      ],
        '权': '',
          '禄': '子女活泼，得异性缘。行运逢之指暗桃花，对象为年轻者',
            '科': '',
              '忌': '子女之间不合或有桃色官非',
    },
    '天府': {
      'desc': [
        '子女均以才能著称, 而且长大之后对您孝敬有加，邻里称羡',
        '子女个性大多是急性子, '
      ],
    },
    '太阴': {
      'desc': [
        '子女很有做事的才干，非常练达而成熟，在小时候就能替您分享。和父母相处得很好',
        '子女感触力非常敏锐，在文学或艺术方面有特殊的禀赋，不过有点神经质，这是无可避免的，做父母的必须细心体谅'
      ],
        '权': '女儿刻苦耐劳乖巧',
          '禄': '子女聪明有人缘，本人有机会买不动产',
            '科': '会留遗产给子女',
              '忌': '为女儿操劳',
    },
    '贪狼': {
      'desc': [
        '有早婚生子的迹象，孩子来得不是时候造成你们夫妻很大的困扰，不谐调的婚姻生活造成的结果是使子女重蹈覆辙',
        '子女个性强烈善变，有不达目的绝不中止的手段和决心，常做出令父母惭愧的事情'
      ],
        '权': '教养态度过于霸道，需注意子女反弹',
          '禄': '身体状况佳，性欲强',
            '科': '',
              '忌': '子女易为感情烦恼，本人防桃花',
    },
    '巨门': {
      'desc': [
        '子女常用言语表达自己内心的不满，也会招惹双亲的不快，但对外则以言语的口才见长，具有强烈的说明能力',
      ],
        '权': '子女口舌凌厉，好争辩',
          '禄': '子女口才好',
            '科': '',
              '忌': '与子女有代沟',
    },
    '天相': {
      'desc': [
        '子女有诚实敦厚的特性，不喜欢和其他的小孩子伴玩在一起，不愿意从事不感兴趣的行业',
        '子女长大后非常注重体面，爱惜面子是他们的特性'
      ],
    },
    '天梁': {
      'desc': [
        '子女小时即能独力处理自己切身的事情，样样不需父母操心，稍成长时，具有领导统御的能力，俨然为同侪之王',
        '子女以孝顺者居多，尤其是女儿更是向娘家'
      ],
        '权': '子女自主力强不需父母管',
          '禄': '子女有长辈缘',
            '科': '对子女很贴心',
              '忌': '',
    },
    '七杀': {
      'desc': [
        '子女个性非常强烈、不受教，和父母发生冲突，父母子女间的感情也很淡薄，多由于七杀星的特性使然',
      ],
    },
    '破军': {
      'desc': [
        '子女禀性好动，不喜欢在家承欢膝下',
      ],
        '权': '子女对家有助，座子午宫主子女将来有成就',
          '禄': '子女过于外向，行运逢之，小心有桃花劫',
            '科': '',
              '忌': '',
    },
    '左辅': {
      'desc': [
        '子女不需要您操心，也不会给父母增添麻烦，幼小时少哭闹，稍成长时，对自己切身的东西也是整理得井井有条，在课业方面，生活方面都不需要父母的操心',
      ],
        '权': '',
          '禄': '',
            '科': '子女得人缘，也表自己喜欢年轻异性',
              '忌': '',
    },
    '右弼': {
      'desc': [
        '子女多聪明而伶俐，很能体贴父母的心意，帮助父母处理家里很多琐碎的事，女儿更是母亲的好帮手',
      ],
        '权': '',
          '禄': '',
            '科': '子女得人缘，也表自己喜欢年轻异性',
              '忌': '',
    },
    '文昌': {
      'desc': [
        '子女外表出众，而且有文艺气息和天赋，在文学的造诣和艺术的修养上都出类拔萃',
        '可受子女的福荫，晚年时得清闲而安享天伦之乐'
      ],
        '权': '',
          '禄': '',
            '科': '子女温文儒雅',
              '忌': '子女过于情绪化或动作粗鲁',
    },
    '文曲': {
      'desc': [
        '父母子女间的感情很融洽，您的子女心思乖巧，很会讨父母的欢喜，仍以文艺见长，在年少时即小有名气，将来您会因子而扬名于世，因您孕育出一代的文学大师',
      ],
        '权': '',
          '禄': '',
            '科': '子女温文儒雅',
              '忌': '子女或本人易为感情烦恼',
    },
    '天魁': {
      'desc': [
        '子女属于不让父母麻烦之类型，具有强烈独立性',
        '如果子女宫只有天魁星独坐的话，暗示您的子女声名将凌驾您之上。将来您将领受子女的福荫'
      ],
    },
    '天钺': {
      'desc': [
        '子女很有才能，这种才能不与聪明成正比，而是在处理日常生活的杂务上，有特殊的才干',
      ],
    },
    '擎羊': {
      'desc': [
        '子女个性稍嫌暴烈，而且自幼即病痛缠身，很难养育',
      ],
    },
    '陀罗': {
      'desc': [
        '您的一子破坏性极大，而且个性怪异，不易与人相处，缺乏良好的人际关系，因此和父母相处的时间最多',
      ],
    },
    '火星': {
      'desc': [
        '子女的个性特别火爆，在管教方面确是要多费一番苦心',
      ],
    },
    '铃星': {
      'desc': [
        '没有子女缘，自己可能无子女，领养的子女个性又特别怪异，常常和父母发生意见上的对立，乖僻而且倔强',
      ],
    },
    '地空': {
      'desc': [
        '子女天性无情而冷漠，只顾自己的利益较少为他人着想',
      ],
    },
    '地劫': {
      'desc': [
        '子女对您的恩情并不重视，父母子女之间形同路人',
      ],
    },
    '天马': {
      'desc': [
        '子女少年时即离家，与父母相聚的时日不多，带有变化性的色彩, 两者皆因移动而使得彼此间的关系愈来愈疏远',
      ],
    },
    '禄存': {
      'desc': [
        '子女少年时即离家，与父母相聚的时日不多，带有变化性的色彩, 两者皆因移动而使得彼此间的关系愈来愈疏远',
      ],
    },
  },
  '财帛': {
    'desc': '财帛宫主一生财富多寡，理财能力，赚钱本领，财运好坏，对财富的态度，节约或浪费，财源性质和稳定与否，正道抑或喜发横财等等。财帛宫乃推论命造的财运吉凶',
    '紫微': {
      'desc': [
        '一生衣食无虞，紫微星本为帝王之星，在财帛宫独坐的话，暗示财运极佳，或则出生之处即为豪富之家',
      ],
        '权': '官禄主，掌财有方，理财有术',
          '禄': '',
            '科': '贵人，若是公门之财可安稳度日',
              '忌': '',
    },
    '天机': {
      'desc': [
        '钱财来源多得之于实际的力量，必须要劳费相当的心力，才能得到对等的钱财，说白了要想获得财富，要适当冒一些风险',
      ],
        '权': '善于钱财之策画运用调度',
          '禄': '钱财流动性大，遇吉则大进大出，遇凶则为过手之财',
            '科': '适合担任处理金钱之工作',
              '忌': '为钱费心机，适合赚五术之钱',
    },
    '太阳': {
      'desc': [
        '势必因钱财之事而传名于世，主要因为太阳星光芒的强烈四射，象微财运的亨通',
        '富有经商理财的才能，对于大事业、大规模的投资，非常大处断的能力，在商业界海内外皆知'
      ],
        '权': '男命主创业，发展迅速，得心应手',
          '禄': '可赚大钱，但为人海派，应量入为出',
            '科': '',
              '忌': '男命主不利创业，女命主夫星黯淡',
    },
    '武曲': {
      'desc': [
        '多半是实业界的巨子，握有极大的权势，无论在政界或金融界，都拥有非常大的耐力',
        '即使出生不是富豪之家，在奋斗立业过程中也能突破重重难关，创立一番事业，积聚不少钱财'
      ],
        '权': '财势望，闹中取材，能掌控金钱进出',
          '禄': '一生不欠钱财，赚钱有一套',
            '科': '财名两利，安稳可守，若中年发达，可守一生',
              '忌': '破财',
    },
    '天同': {
      'desc': [
        '对于钱财有不同于人的看法，不会通过拼命卷来获取钱财，而是白手起家，靠着对工作的热诚立下基业，中年以后，财富渐增',
      ],
        '权': '财运好，坐享其成',
          '禄': '有钱可享而已，主人无作为或懒于赚钱，天同不喜禄',
            '科': '',
              '忌': '赚钱不易',
    },
    '廉贞': {
      'desc': [
        '可由经商而致富，但其中的过程，并不如外人所想像如此的容易，其间尚有许多暗波，但结局对己有利',
      ],
        '权': '',
        '禄': '工作赚钱顺利，财源稳定',
        '科': '',
        '忌': '官非损财或桃花损财',
    },
    '天府': {
      'desc': [
        '天府星所代表的是天上的财库，因此天府星在财帛宫的人，一生衣食无忧、生活富足',
      ],
    },
    '太阴': {
      'desc': [
        '与钱财结缘，虽无大力于工作或事业，却总是非常顺利，除了赚取正常的利润外，也经常发生超额的利润',
      ],
        '权': '男靠女得财，女命主可创业，辛苦有成',
        '禄': '财自远方来，财经异性之助而得',
        '科': '适合赚女人钱，男主得配偶之助进财',
        '忌': '女命主创业无力，行运逢之指投资失利',
    },
    '贪狼': {
      'desc': [
        '工作欲很强，不过这种工作欲不是正常的工作欲，而是获得钱财的一种手段，会不惜一切，巧取豪夺的赚取钱财，手段正当与否在所不计，一生中以发横财致富者为多',
        '如果贪狼星落陷，成败在一线之间，常搞得您头破血流，由至富沦为至贫，以贫穷终其一生'
      ],
        '权': '创业，交际手腕好，可得横财，男忌沉溺女色',
        '禄': '能赚钱，但须交际应酬才能赚到钱，主偏财，略带投机，忌赌性坚强',
        '科': '',
        '忌': '钱财不顺或桃花损财',
    },
    '巨门': {
      'desc': [
        '对于钱财有掌握的欲望，不喜欢由父母处得到既有的财帛，喜欢凭自己的能力去赚取, 但赚钱比较辛苦',
        '因为强烈的物欲而对金钱有执着的现象，所以应该避免的是不要抱着太高的目标，否则易遭重大的损失'
      ],
        '权': '以口为业，竞争得财，应以和为贵，否则易生事端',
        '禄': '需靠口才交际才能入财',
        '科': '',
        '忌': '会为钱财常与人起冲突',
    },
    '天相': {
      'desc': [
        '一生财运亨通，钱财滚滚而来, 而且对理财颇有心得，能化一为二，再多的钱财、再大的企业都整理得井井有条',
      ],
    },
    '天梁': {
      'desc': [
        '多不以钱财为重，顺其自然而得之，不喜欢汲汲以求利',
        '因为强烈的物欲而对金钱有执着的现象，所以应该避免的是不要抱着太高的目标，否则易遭重大的损失'
      ],
        '权': '辛劳可守，有长辈管束更能守财',
        '禄': '靠长辈提携入财，故需加入狗腿族才能入财',
        '科': '金钱有难，会得长辈相助',
        '忌': '',
    },
    '七杀': {
      'desc': [
        '财运不错，比较喜欢从事冒险性的工作，对于固定缺乏挑战性的工作不屑一顾',
        '在钱财的得失方面变动幅度很大，可能在昼夜间成为巨富，也可能在几个时辰内成为一贫如洗'
      ],
    },
    '破军': {
      'desc': [
        '拥有独立策划的能力，对事物有其独特的看法，在思想上走上与众不同的路线，能因此而发迹，拥有令人羡慕的财富',
      ],
        '权': '晚得财，先去后来，先破后得',
        '禄': '意外之财，暴得之财，破军横发横破，故禄也比较容易借到巨款',
            '科': '',
              '忌': '',
    },
    '左辅': {
      'desc': [
        '一生富足，虽然不免辛劳，但福气厚仍有许多钱财紧跟随',
      ],
      '科': '在钱财上有贵人相助，属明贵人',
    },
    '右弼': {
      'desc': [
        '对钱财采积极的争取态度，有正确的处世观念, 也代表一生富足、衣食无虞',
        '不以从事一项职业为满足，喜欢多方的尝试，所踏入的行业薪水多比平常要高'
      ],
        '科': '在钱财上有贵人相助，属暗贵人',
    },
    '文昌': {
      'desc': [
        '一生衣食无虑，以辛勤而获得钱财的报酬，姑不论其对等性如何，终究是财富的积存',
      ],
        '科': '常有分期付款情形',
    },
    '文曲': {
      'desc': [
        '在获得钱财时亦同时取得声名。拥有很高的理财能力，对于投资的事项有个人特殊的看法',
      ],
        '权': '',
          '禄': '',
        '科': '常有分期付款情形',
        '忌': '文曲主金钱感情，忌则损钱伤感情',
    },
    '天魁': {
      'desc': [
        '喜与金钱为伍，以清高自许，但钱财获得容，易能得到长者的帮助，事业顺人心',
      ],
    },
    '天钺': {
      'desc': [
        '一生顺遂，在金钱方面春风得意，有接连不断的机缘和财运',
      ],
    },
    '擎羊': {
      'desc': [
        '擎羊星在财帛宫的人，最怕落入陷宫，如果真是如此的话多暗示，祖先所遗留的财帛无法守住，自己一生财运亦不佳',
      ],
    },
    '陀罗': {
      'desc': [
        '与钱财无缘，即使拥有钱财也会在无计划的用度下，把钱财散尽，赚得不多，但花费很惊人',
      ],
    },
    '火星': {
      'desc': [
        '火星在财帛宫时，变动性非常强烈，如果火星入庙的话，而且没有其他星曜同坐时，有横财可发，在一夜之间成为家喻户晓的暴发户',
      ],
    },
    '铃星': {
      'desc': [
        '铃星独坐财帛宫时，气势强烈，也有横发之势，但是可在一夕成富亦可能在一夜之间破产，成败难以定论',
      ],
    }, 
    '地空': {
      'desc': [
        '财运不佳，又对钱财用度没有节制，身边常是空空如洗',
      ],
    },
    '地劫': {
      'desc': [
        '财运不佳，尤其在金钱方面，波动性很大，稍一不慎就会身系桎梏，受金钱所拖累',
      ],
    },
    '天马': {
      'desc': [
        '在奔动中才会得财，假如有出国或旅行的机会时，都须把握时机去赚钱，因为惟有在奔动时，才是财源滚进良机',
      ],
    },
    '禄存': {
      'desc': [
        '一生过着富足的生活，比别人多享受一层财运的庇佑，不待劳苦而得财，虽未刻意去追，求却财帛自来',
      ],
    },
  },
  '疾厄': {
    'desc': '疾厄宫可以帮助了解疾病轻重、种类，先天那个器官较弱，一生中有无重大灾病，生病之地、疾病的来源，凶险意外、生死等。也可用来观察个人情绪表达方式，并透露出个人的生活能力与爱好',
    '紫微': {
      'desc': [
        '一生较少病痛, 身体很好, 即使生病也是轻微的一些病症',
      ],
        '权': '对健康过于敏锐，会无病呻吟，疏于工作',
        '禄': '',
        '科': '身体健康，纵有灾病，定有贵人解救',
        '忌': '',
    },
    '天机': {
      'desc': [
        '幼年时身体状况较差',
      ],
        '权': '喜欢文学，会为工作学业熬夜，注意肝脏保养',
        '禄': '聪颖，思考清晰',
        '科': '会注重休闲生活，身体也会适度放松',
        '忌': '头疾,如: 脱发, 头痛，勿熬夜',
    },
    '太阳': {
      'desc': [
        '身体比较容易产生的病状是：头、眼视力不明、多汗，不自觉的颜面抽动、眼球自外突出等',
      ],
        '权': '比较容易有颈部问题',
        '禄': '心地光明，不太计较',
        '科': '',
        '忌': '个性，忌则内心过燥，注意高血压。精神疲劳等',
    },
    '武曲': {
      'desc': [
        '幼年时多灾病，四肢或头部、脸部会因而受创, 易于表现的微状是骨骼疼痛、关节部占的异常、喉咙或气管的不适、感冒就会带来更严重的肺炎等',
      ],
        '权': '体质差',
        '禄': '比较能克制自己的脾气',
        '科': '身体可得到调养',
        '忌': '体质差，尤其肺部方面',
    },
    '天同': {
      'desc': [
        '一生灾病少，比较容易病的部位是胃和肠, 与其他煞星同宫注意车祸等意外之灾',
      ],
        '权': '身体健硕，中年之后防发福',
        '禄': '宽体胖，天同禄喜入疾厄宫，就算有疾，也容易痊愈',
            '科': '',
        '忌': '膀胱肾脏有问题。女命主经期不调',
    },
    '廉贞': {
      'desc': [
        '幼年时有疮痘之痛，容易生疮溃烂，一经过成年之后就会痊愈，腰部或足部有一些障碍',
      ],
        '权': '',
        '禄': '命犯桃花, 重情欲',
        '科': '',
        '忌': '行运逢之，主意外，或桃色之事',
    },
    '天府': {
      'desc': [
        '一生中很少生病，即使有病也是一些很容易治愈的病症',
      ],
        '权': '',
          '禄': '命有桃花运, 重情欲',
            '科': '',
              '忌': '行运逢之，主意外，或桃色之事',
    },
    '太阴': {
      'desc': [
        '比较容易发生的症状是腹痛、腰痛、耳鸣、心悸、生理失调、四肢无力',
      ],
        '权': '太重道德名节，常忧郁烦躁，需学会抗压',
        '禄': '心地光明，比较有正面思考',
        '科': '女性友人会关心您的健康',
        '忌': '主暗，男主肾科，女主妇女病',
    },
    '贪狼': {
      'desc': [
        '比一般人还要健康，但容易罹患排泄器官和代谢系统方面的疾病',
      ],
        '权': '小心身体纵欲过度有损，喜往外跑易外伤',
        '禄': '命有桃花运，重情欲',
            '科': '',
        '忌': '性欲较强，注意肾亏，也容易得性病',
    },
    '巨门': {
      'desc': [
        '一般而言，多与胃肠方面的疾病有关，例如胃炎、肠炎、胃下垂、便秘、消化不良、吸收情形不良等',
      ],
        '权': '不宜饮酒，容易酒后失言',
        '禄': '有口福，喜美食热闹',
            '科': '',
        '忌': '酒品较差，不宜饮酒',
    },
    '天相': {
      'desc': [
        '一生不会发生很严重的疾病，而且以健康的时间居多, 比较可能染患的病症多是关于皮肤性的如面皮黄肿。例如：黄疳、水肿、香港脚、青春痘、疥疮等。或血气之疾，如高血压或呼吸系统的毛病',
      ],
    },
    '天梁': {
      'desc': [
        '比较容易患病的部位是肝、肺和胃，有打嗝、咳嗽、容易疲劳等现象',
      ],
        '权': '父母管束生活起居，觉得不自由',
        '禄': '长寿，身体健康，得长辈照顾',
        '科': '身体会得到长辈照顾',
        '忌': '',
    },
    '七杀': {
      'desc': [
        '从小就一直生病到长大，身体方面总有某些部位不调适，而与医药为伍, 长大以后可能会有痔疮方面的毛病',
      ],
    },
    '破军': {
      'desc': [
        '大部份易犯血气方面的毛病。力不从心的感觉而且草草了事, 就女性而言，言则生理上多不调顺，或有子宫、卵巢方面的暗疾，也可能有糖尿病的症候',
      ],
        '权': '为工作操烦，注意情绪容易暴躁',
        '禄': '喜享受奢糜，注意花钱需节制',
        '科': '',
        '忌': '',
    },
    '左辅': {
      'desc': [
        '一生灾病少，没有横灾、横祸所引起的外伤，也不会发生严重的病症, 身体最弱的部位是脾脏和胃，尤其是胃，必须要特别泣意定时定量',
      ],
        '科': '生病时会遇到好的医师',
    },
    '右弼': {
      'desc': [
        '一生没有大病, 比较容易拥有的症状是口干舌燥、虚火上升，或胃寒经常上吐下痢等，疾病多由体内寒热而生，但病情不会很严重至无法处理的地步',
      ],
        '科': '生病时会遇到好的医师',
    },
    '文昌': {
      'desc': [
        '一生灾病少，身体上比较羸弱的部分是肠、肺或耳朵，发病时可以采用食物疗法，有耐心的去改变去强化某部分脏器的功能',
      ],
        '科': '宜多尊重医生意见',
        '忌': '肺部，咳嗽，心头郁闷',
    },
    '文曲': {
      'desc': [
        '先天体质訧不错，疾病少有。最容易发病的部位是肝和胆，有时雀斑横生或皮肤粗糙即因此而来',
      ],
        '科': '宜多尊重医生意见',
        '忌': '心病，或易得相思病。女命胎运较差需注意',
    },
    '天魁': {
      'desc': [
        '一生中逢灾能化吉，不会有什么大灾难, 即使重病也能遇到良医，起死回生，屡试不爽。天魁星在疾厄宫者，最容易得的是肝病，视力减退、疲倦感加深、皮肤病变都由此而生',
      ],
    },
    '天钺': {
      'desc': [
        '一生中不会有很严重的病害，或横祸。脾、胃和肺最为脆弱，引申出来的即是呼吸不顺畅和胃酸、呕吐、水肿等症状',
      ],
    },
    '擎羊': {
      'desc': [
        '身体最衰弱的部位是头部，其次是肠、胃，症状是头晖目眩、消化不良、特别虚弱等',
      ],
    },
    '陀罗': {
      'desc': [
        '身体最衰弱的部位是肺脏，呼吸系统的不良，连带的影响血液循环系统的作业',
      ],
    },
    '火星': {
      'desc': [
        '比较没有疾病的烦恼，健康情形比普通人还要好',
      ],
    },
    '铃星': {
      'desc': [
        '对于健康并不特别重视，但却很少患病，健康情形很好, 最容易得的是皮肤病，尤其是痒和肿涨',
      ],
    },
    '地空': {
      'desc': [
        '比常人更注意自己的身体状况，因为疾病多隐藏于暗处，但是一旦爆发出来，它的威力却比一般人强过很多倍',
      ],
    },
    '地劫': {
      'desc': [
        '健康情形不佳，经常因为环境的影响而卧病，也是各种传染病的带菌者，多由于其本身体质的关系',
      ],
    },
    '天马': {
      'desc': [
        '要特别节制男女之事，男性而言有自慰、手淫的恶习，因而导致肾虚、早泄等症状, 就女性而，言易有白带过多、经痛、腹痛等症状',
      ],
    },
    '禄存': {
      'desc': [
        '年幼时多病，一直到成年都有突然来袭的灾痛，惟成年之后健康状况极佳。身体上比较虚弱的部位是牌脏和肺脏',
      ],
    },
  },
  '迁移': {
    'desc': '迁移宫可推断一个人由出生地迁移到外地的命运，显示一个人在外地的顺逆吉凶的具体情况，以及在外旅行、经商、社交、定居、出国等遭遇如何，有无贵人帮助，居住环境之好坏，待遇之优劣，或意外灾祸，旅途是否平安，在外的适应能力如何',
    '紫微': {
      'desc': [
        '出外得贵，得助多方，交游广阔，人际关系良好，可得长辈提拔，交往层次越年长越提升',
        '在外面环境的行为举止，面貌谈吐，自然流露不可抗拒之说服力'
      ],
        '权': '出外得贵，受扶持，可名利双收',
        '禄': '',
        '科': '出外得贵，受扶持，然名高于利仅虚名而已',
        '忌': '',
    },
    '天机': {
      'desc': [
        '外在机巧灵敏，好动，点子多, 喜欢多变动的性质或活动，若有机会在异乡发展也会得心应手',
      ],
        '权': '远行。若于四马地，再遇天马，必定出国，且有计划性出国',
        '禄': '适合远行，迁居',
        '科': '有公派出国旅行机会',
        '忌': '交通事故，外伤',
    },
    '太阳': {
      'desc': [
        '出外得贵，宜早年在外独立生活, 好管闲事，个性直率，尤其白天出生更加应验',
      ],
        '权': '男命主创业，可长实权，女命可靠男性顾客进财',
        '禄': '重虚名，喜交际应酬',
            '科': '',
        '忌': '在外劳禄，冲命宫，会惹是非',
    },
    '武曲': {
      'desc': [
        '外在能力强，喜主动，好争强, 而且属于能者多劳型，不免奔波操劳',
      ],
        '权': '为创业奔波赚钱',
        '禄': '喜欢在饭桌上解决商场之事，是交际高手',
        '科': '可在交际场所认识客户',
        '忌': '出外助力少，需靠自己赚钱，甚至为别人耗财',
    },
    '天同': {
      'desc': [
        '个性随和，人缘佳，出外发展时会遇到贵人的相助',
      ],
        '权': '朋友多，生活过于享受',
        '禄': '在外广结善缘，但做事不够拘谨',
            '科': '',
        '忌': '出外常有协调不良之事，防公亲变事主',
    },
    '廉贞': {
      'desc': [
        '在外很有异性缘，宜多到外面活动比较会有发达机会，有时候搬家或转业会给你带来好的运道',
      ],
        '权': '',
        '禄': '出外得异性之助，且异性缘浓。限运逢之，有姻缘已婚者注意桃花',
            '科': '',
        '忌': '注意官非，车祸意外，或交通罚单，桃色纠纷',
    },
    '天府': {
      'desc': [
        '外出得福，转业时会得到长辈的提携，不会发生困难，天府星喜欢助人，更喜欢结交比自己强的人',
      ],
    },
    '太阴': {
      'desc': [
        '在外有女性缘，多得女性之助，太阴星耐力足，喜夜生活',
      ],
        '权': '出外务时会得到女性友人帮助',
        '禄': '喜欢旅游，接近大自然',
        '科': '出外旅游会有邂逅机会',
        '忌': '在外容易遭小人，尤其是女人',
    },
    '贪狼': {
      'desc': [
        '爱表现，爱刺激，喜欢新奇事物，贪狼星在外异性缘好可适应繁忙奔波生活，喜欢与闹区接近。喜欢寻找发财的机会，喜为金钱劳禄',
      ],
        '权': '喜掌权，好动有冲劲，防沉溺酒色',
        '禄': '出外得异性之助，且异性缘浓。限运逢之，有姻缘已婚者注意桃花。过于慷慨好客，应注意量入为出',
            '科': '',
        '忌': '出外防酒色损财，或桃色纠纷',
    },
    '巨门': {
      'desc': [
        '喜争强，好辩论，巨门星口才奇佳，可在争论上占上风，不说过于尖锐的话对自己并没有什么好处',
      ],
        '权': '在外可以口为业，但注意言语过于强势，难免得罪人',
        '禄': '喜口福应酬，然注意勿过于重视酒肉朋友',
            '科': '',
        '忌': '在外防口舌是非',
    },
    '天相': {
      'desc': [
        '当你要做重大决定如迁移或转业（或要辞掉老板时），只要你认为已有相当布署时，下定决心吧，优柔寡断对您没好处',
      ],
    },
    '天梁': {
      'desc': [
        '要学会谦虚，记得蹲的越低才能跳得越高',
      ],
        '权': '在外喜称老大，领导群体',
        '禄': '出外应对得体，老成深重，但注意不要过于事故依老卖老',
        '科': '有当主管机会',
        '忌': '',
    },
    '七杀': {
      'desc': [
        '活动力强，喜欢往外跑，会坚持己见，认为对的事，不轻易改变',
      ],
    },
    '破军': {
      'desc': [
        '命宫为天相星，在外喜管闲事，然天相星责任感不足，故破军星在外总有让人觉得成事不足败事有余之感，走到哪里破到哪里',
      ],
        '权': '在外奔波。尤其入寅申巳亥更强烈',
        '禄': '有人缘，交友满天下',
            '科': '',
              '忌': '',
    },
    '左辅': {
      'desc': [
        '会得到他人的扶助',
      ],
        '科': '可得到同事的帮忙',
    },
    '右弼': {
      'desc': [
        '可因贵人的扶助而发达',
      ],
        '科': '可得到同事的帮忙',
    },
    '文昌': {
      'desc': [
        '在外发展会很顺利',
      ],
        '权': '',
          '禄': '',
        '科': '在外会有升迁机会',
        '忌': '出外防诈骗，或契约纠纷',
    },
    '文曲': {
      'desc': [
        '有贵人帮助，求财得财',
      ],
        '权': '',
          '禄': '',
        '科': '在外会有升迁机会',
        '忌': '出外防感情纠纷，或契约纠纷',
    },
    '天魁': {
      'desc': [
        '无论外出或在家皆很如意',
      ],
    },
    '天钺': {
      'desc': [
        '在外经商对你来说会有利可得',
      ],
    },
    '擎羊': {
      'desc': [
        '可积极的向外发展，可以获得高薪，或事业有成，不必顾虑途中所可能发生的困境。但防他人的是非，例如转业时受到新同事的排斥，以及迁居时新邻居们的闲言闲语',
      ],
    },
    '陀罗': {
      'desc': [
        '与擎羊雷同可积极的向外发展，可以获得高薪，或事业有成，不必顾虑途中所可能发生的困境, 但防他人的是非，例如转业时受到新同事的排斥，以及迁居时新邻居们的闲言闲语',
      ],
    },
    '火星': {
      'desc': [
        '为人刚猛，在外的话锋芒十足，小心过于急性吃亏',
      ],
    },
    '铃星': {
      'desc': [
        '为人急却，遇事冲动，小心过于率直吃暗亏',
      ],
    },
    '地空': {
      'desc': [
        '生活多变化，在外谋职经商求学需防耐力不足得不到成果',
      ],
    },
    '地劫': {
      'desc': [
        '生活多变化，在外谋职经商求学需防耐力不足得不到成果',
      ],
    },
    '天马': {
      'desc': [
        '生命充满了活动力',
      ],
    },
    '禄存': {
      'desc': [
        '外出时不必担忧衣、食，常可顺利获得',
      ],
    },
  },
  '仆役': {
    'desc': '交友宫主自己与部属之间的关系，交友状况，对待的状况，人际关系的好坏，平辈间的关系，得力与否。也象征领导统御能力。交友宫乃推论命造的朋友、同事、部属、客户之关系',
    '紫微': {
      'desc': [
        '身旁围绕很多朋友。而且朋友的地位很高',
      ],
        '权': '容易交到公务军警界的朋友',
          '禄': '',
        '科': '容易交到官场上朋友',
        '忌': '',
    },
    '天机': {
      'desc': [
        '朋友们大多拥有非凡的才干',
      ],
        '权': '可交到有智慧朋友，但会比较深沉有心机',
        '禄': '可结交到有才华的好朋友',
        '科': '可结交到有浪漫的好朋友',
        '忌': '注意权谋较深的朋友',
    },
    '太阳': {
      'desc': [
        '在结交朋友方面非常地积极，而且多结交活跃性强烈的朋友',
      ],
        '权': '容易交到老板或主管的朋友',
        '禄': '更容易结交四方豪杰，然容易空留虚名',
            '科': '',
        '忌': '注意男性友人',
    },
    '武曲': {
      'desc': [
        '朋友很多，而且各路英雄好汉都有',
      ],
        '权': '容易交到金融商界朋友',
        '禄': '善于在酒宴中谈生意',
        '科': '容易在酒宴中交朋友',
        '忌': '注意脾气不好之友，莫与争执否则吃亏',
    },
    '天同': {
      'desc': [
        '朋友大多敬佩你，所以很死忠，且朋友的关系不错，对你的帮助也很大',
      ],
        '权': '朋友多，但多是酒肉朋友',
        '禄': '朋友还算义气，但勿流于酒肉朋友',
        '科': '',
        '忌': '会因酒肉朋友而损财',
    },
    '廉贞': {
      'desc': [
        '异性朋友较多，同性的朋友反而少',
      ],
        '权': '',
        '禄': '喜交际应酬，有红粉知己，勿过度以免沉迷酒色',
            '科': '',
        '忌': '勿与朋友兴讼，或结交品行不良之友，可能惹官非',
    },
    '天府': {
      'desc': [
        '朋友多，背景好，而且大多肯出力协助你',
      ],
    },
    '太阴': {
      'desc': [
        '朋友很多，但和异性的朋友较谈得来。且朋友的年记大都比你大',
      ],
        '权': '得异性朋友之助，但朋友主观意见强',
        '禄': '更有机会结交异性知己，得异性朋友之助',
        '科': '得异性朋友之助',
        '忌': '注意女性友人',
    },
    '贪狼': {
      'desc': [
        '不容易交到真正知心的朋友，如果有的话也是酒肉之交',
      ],
        '权': '桃花，亦指有酒肉朋友',
        '禄': '慷慨好客，重朋友薄家人，需防朋友相害',
            '科': '',
        '忌': '与朋友容易有桃花纠葛',
    },
    '巨门': {
      'desc': [
        '和朋友关系良好，你很善于运用各种关系的人。但可能常朋友发生口角',
      ],
        '权': '朋友中有口才犀利者',
        '禄': '有口福，喜应酬',
        '科': '',
        '忌': '喜欢与朋友争口舌之快，而得罪朋友',
    },
    '天相': {
      'desc': [
        '在中年时可望得到友人的帮助而建立基业，因此若是要与人合作经营的话，以中年时较妥当，比较能顺利成事，而不会发生权益上的纠纷',
      ],
    },
    '天梁': {
      'desc': [
        '拥有许多崇拜您的友人，愿意尽力为您服务',
      ],
        '权': '朋友中会有权位比您高的人，但助益不如天梁禄',
        '禄': '容易得到位高权重朋友之助',
        '科': '朋友中会有权位比您高的普通朋友',
        '忌': '',
    },
    '七杀': {
      'desc': [
        '朋友对你而言，没有多大助益反而带来烦恼，而且具有很大的危险性。故而朋友宜少不宜多',
      ],
    },
    '破军': {
      'desc': [
        '朋友对你而言，没有多大助益反而带来烦恼，而且具有很大的危险性。故而朋友宜少不宜多',
      ],
    },
    '左辅': {
      'desc': [
        '会因为朋友的帮助而赚钱',
      ],
        '科': '会有金钱往来的朋友',
    },
    '右弼': {
      'desc': [
        '能因朋友之助而成事的人。但所成就之事与金钱没有直接关连',
      ],
        '科': '会有金钱往来的朋友',
    },
    '文昌': {
      'desc': [
        '喜欢以文会友，朋友的气质高尚。如果你是主管或老板的话，可以得到得力的部属，对您的事业进展很有帮助',
      ],
        '科': '喜欢以文会友',
        '忌': '与朋友有利益冲突，注意文书契约问题',
    },
    '文曲': {
      'desc': [
        '你的朋友是你的智囊团，听取他们的建议，对您的帮助很大',
      ],
        '科': '喜欢以文会友',
        '忌': '会因情绪问题与朋友不合',
    },
    '天魁': {
      'desc': [
        '你的朋友非常好，无论你遭遇何种挫折，都有贵人来逢凶化吉。无论在物质或精神方面都是您的力量来源',
      ],
    },
    '天钺': {
      'desc': [
        '有很多异性知己，在精神或物质方面皆有实质帮助',
      ],
    },
    '擎羊': {
      'desc': [
        '有一些恶友会防碍你。也就是说，平常的时候这些朋友不会为恶，但当你有困难时这些朋友反而会干扰出现的贵人',
      ],
    },
    '陀罗': {
      'desc': [
        '会帮助你的朋友不多',
      ],
    },
    '火星': {
      'desc': [
        '你不容易和别人相处，人际关系很差',
      ],
    },
    '铃星': {
      'desc': [
        '人际关系不好，不得人缘',
      ],
    },
    '地空': {
      'desc': [
        '有一些朋友会阻碍你，使你在人生旅途中遇到不少的波折',
      ],
    },
    '地劫': {
      'desc': [
        '当你有困难时，会阻碍贵人出现或更加消耗你的实力的朋友',
      ],
    },
    '天马': {
      'desc': [
        '你的朋友来自各方各层面，交游分子复杂，朋友特多，不过多属泛泛之交',
      ],
    },
    '禄存': {
      'desc': [
        '朋友对你的事业有很大的帮助，资本上的支持及实际上的支持兼有之',
      ],
    },
  },
  '官禄': {
    'desc': '事业宫主事业贵贱，职位高低，自己与上司及事业伙伴间的关系，企图心如何，奉职能力，工作的态度，从事的行业性质，事业发展倾向，宜创业或打工，技术专长，以及变动状况等。乃推论命造的工作、职业、事业吉凶状况',
    '紫微': {
      'desc': [
        '拥有许多崇拜您的友人，愿意尽力为您服务',
      ],
        '权': '可掌实权，升迁机会大',
        '禄': '',
        '科': '宜公职，若创业宜作与公家有关之生意',
        '忌': '',
    },
    '天机': {
      'desc': [
        '有独特的思想，可能走向学问的专门研究或是杂志、报社的编辑者，也可能成为一个艺术追求者，例如：画家、书法家、设计师等',
        '女性若不是成为有名的艺术家，就会是一个贤内助，家庭的发展就是她的事业'
      ],
        '权': '善于用智慧规划创业，加煞忌为创业辛劳',
        '禄': '善赚智慧财，凭智慧创业，勿过于耍小聪明，免华而不实',
        '科': '可从事需靠脑子的工作',
        '忌': '不宜从事机械或需要绞尽脑汁之工作事业，会有失败之虑',
    },
    '太阳': {
      'desc': [
        '处在一种高度竞争性的工作环境中，例如政治家、建筑师、律师等。女性则可从事导游业或餐饮服务业',
        '如果太阳星坐事业宫又在午宫独坐大吉，此人可创下大事业、领导群伦，将来成就非凡'
      ],
        '权': '有老板格，为人海派，女命有男人之志，有机会从事政治外交或民意代表之流',
        '禄': '有老板格，拥实权，纵为上班族，也可当上主管',
        '科': '',
        '忌': '男命创业不利，工作易受男性主管刁难',
    },
    '武曲': {
      'desc': [
        '男性而言，善理财的人可能做企业家或从事金融业务方面的工作, 女性则是标准的职业妇女，在各行各业都能生存，在行业上崭露头角和男性一较长短的亦不在少数'
      ],
        '权': '掌财权，尤其在军警或金融业可为主管',
        '禄': '工作或事业金钱流动顺遂，可从事与金融有关的职业或事业',
        '科': '宜武职，或金融业',
        '忌': '在生意上会有资金周转问题，或是部属员工亏空公款',
    },
    '天同': {
      'desc': [
        '男性喜欢悠关稳定生活的特性，对创业敬而远之，即使是任职也不大提得起劲，适合做一个自由业者, 女性则是标准的职业妇女，在各行各业都能生存，在行业上崭露头角和男性一较长短的亦不在少数'
      ],
        '权': '可靠人脉关系创业',
        '禄': '可轻松进财，然不够积极，过份依靠财运，反伤害潜质',
        '科': '',
        '忌': '会因支援或人脉不足而失败',
    },
    '廉贞': {
      'desc': [
        '男性在职业上的注意力非常集中，能够专注于自己所从事的行业，对工作很有耐性，能够不屈不挠的独立完成，适合做公务人员或教师等工作',
        '女性适于走向有关手的技艺方面的工作'
      ],
        '权': '',
        '禄': '做事顺遂，若身宫在事业，得异性之助',
        '科': '',
        '忌': '工作上注意官非，勿待可能触法之行业',
    },
    '天府': {
      'desc': [
        '男性对工作抱着自得自在的态度，不与人争名逐利，最适合做公务员，或自己开一家小店做做小生意，过着与世无争的日子',
        '女性则以秘书或银行员为适合的职业，一般而言，愈具有永久性的职业愈佳'
      ],
    },
    '太阴': {
      'desc': [
        '男性多从事诗人、作家、演员等职业，女性则以演员、歌星为众',
        '太阴星坐子宫时，此人可从事智慧型的行业，例如：律师、程式设计师、编辑等，可以大大发挥所长'
      ],
        '权': '能独立创业，男命主得女性之助创',
        '禄': '事业上可得配偶或异性贵人之助',
        '科': '配偶会藏财',
        '忌': '无论男女，不宜经营不动产，工作上注意女性主管',
    },
    '贪狼': {
      'desc': [
        '男性而言，欲望非常强烈，对于已经确立的目标，绝不轻言放弃，喜欢独立成事，因此对于创业特别感兴趣，而且必须是独资的型态，不喜欢和别人合伙经营，经常踏入的行业是影视圈，尤其是导演的工作更能发挥所长',
        '女性而言，贪狼星在事业宫的人有优秀的演艺才能，也适合在影剧圈求发展，或是充任时装模特儿的工作'
      ],
        '权': '掌握暗权，女命则能垂廉听政',
        '禄': '喜投机财，工作场所得异性之助',
        '科': '',
        '忌': '事业可靠桃花赚钱，不宜为公务人员，会有操守问题，上班族小心办公室恋情',
    },
    '巨门': {
      'desc': [
        '多从事与「口」有关的行业，在言语上博得他人的敬重',
        '男性而言，事业宫持巨门星的人适合做大学教授、律师、政治家等等和说话有关系的行业；就女性而言，则适合做教师等工作'
      ],
        '权': '以口为业，说话有份量，有机会为法官，律师，教师等职业',
        '禄': '从事以口为业之工作，会更具有竞争力',
        '科': '',
        '忌': '事业工作中多口舌是非',
    },
    '天相': {
      'desc': [
        '适合从事一种需要协调关系的职业，例如：保险业、推销业等，能发挥其特质',
      ],
    },
    '天梁': {
      'desc': [
        '男性适合当教师或公务员，或专门类科的学术研究者，其研究之成果易于取得社会大众的认同，而蔚为某一方面的领导人物',
        '女性非常有干才，做为家庭主妇非常可惜，一旦身为职业妇女，就能发挥自己的才能。但是无论男、女都应该避免经商'
      ],
        '权': '管理能力足，霸道但讲道理',
        '禄': '在工作上更容易得上司提拔',
        '科': '名望佳，但非拥实权',
        '忌': '',
    },
    '七杀': {
      'desc': [
        '男性适合做职业运动选手，或是警察等富有挑战性和突破性的工作, 女性而言，一但发挥出七杀星的特性，无论在社会上任一行业，都是女中豪杰',
      ],
    },
    '破军': {
      'desc': [
        '男性适合在治安单位任职，可以抒发其破坏特质，和闲不住的特性, 女性具有领导同侪的性质，可能成为女权运动者，或进入其他男性职业范筹内',
      ],
        '权': '事业变动大，权力一把抓，需注意要能充分授权，才不会过份劳累奔波',
        '禄': '在激烈竞争之事业，更容易胜出',
        '科': '',
        '忌': '',
    },
    '左辅': {
      'desc': [
        '做事绝不拖泥带水，有充分的事前计划，处理事情时不会发生大的缺失, 必须要辛劳才能有收获',
      ],
        '科': '在事业上，获助多',
    },
    '右弼': {
      'desc': [
        '多能以温和的态度来面对困难的工作，但主辛劳, 适合从事体力方面的工作，不适合做文书、教师之类的工作',
      ],
            '科': '在事业上，获助多',
    },
    '文昌': {
      'desc': [
        '在文艺、创作各方面若能发挥其特性，必成一介之士, 适合从事文学研究、设计创作、音乐词曲研究等与艺术相关的行业',
      ],
        '权': '',
          '禄': '',
        '科': '宜走学识路线',
        '忌': '特别注意文书票据问题，从事期货股票方面需小心',
    },
    '文曲': {
      'desc': [
        '适合朝著作与绘画方面发展，引申而言即从事作家、新闻记者、美术从业人员或大众传播事业',
      ],
        '权': '',
          '禄': '',
            '科': '宜走学识路线',
        '忌': '有曲高和寡之象，会因不够务实而失败',
    },
    '天魁': {
      'desc': [
        '在求职或创业的过程里，无往不利，自然有贵人相助，在公司里得到上司的赏识。在司法界发展的话可望居高位',
      ],
    },
    '天钺': {
      'desc': [
        '幸运的光芒笼罩在您的四周，一生机缘层出，适合在学术界或艺术方面发展，如果和天魁星同居一宫的话，一身居高位，权、财、贵并得',
      ],
    },
    '擎羊': {
      'desc': [
        '擎羊有激烈的特性，因此在事业宫上产生一些不好的作用，带来某些不幸的事件, 适合服务于军、警界，可以平衡他激烈的特性',
      ],
    },
    '陀罗': {
      'desc': [
        '陀罗星本质上喜拖延，因此事业宫持陀罗星的人，最适合在公、教界任职，在稳定中求发展',
      ],
    },
    '火星': {
      'desc': [
        '适合从事芋类技术性的工作，例如：电工、木工、水利、测量等，属于技术评等的工作',
      ],
    },
    '铃星': {
      'desc': [
        '铃星具有破坏威力，女性事业宫持铃星者，多为职业妇女',
      ],
    },
    '地空': {
      'desc': [
        '不适合经商，较适合的是以运用思想为主的职业，例如诗人、作家等，可以发挥自己的长才',
      ],
    },
    '地劫': {
      'desc': [
        '最好避免和钱财产生直接的接触或在金钱的计算上打滚，例如经商等最为不利',
      ],
    },
    '天马': {
      'desc': [
        '天马星是一颗活动力特强的星曜，能因奔动而有所获，故而事业宫持天马星的人适合从事活动性较大、活动范围较广的行业',
      ],
    },
    '禄存': {
      'desc': [
        '适合事以个人能力来计薪的工作，例如律师等，能因金钱吸引力，而努力于工作',
      ],
    },
  },
  '田宅': {
    'desc': '田宅宫为财库之位，是藏财之所，代表人的不动产状况，或不动产的多寡，居住的环境好坏，田宅有无变动，变动的情形。命造的早、中、晚年的运程及家庭状况，生活是否富裕等都可以从田宅宫里推算出来',
    '紫微': {
      'desc': [
        '拥有庞大的产业，田宅茂盛，拥有的土地房产不计其数，可先从房屋的建筑业着手，因为紫微星有土缘，是故田产益加之',
        '以居住的地方来说，你适合住在较高的地方，如山上，或附近有山的地方，要不然就是大厦的高楼上'
      ],
        '权': '喜欢家中清幽干净',
          '禄': '',
        '科': '家庭布置高贵',
              '忌': '',
    },
    '天机': {
      'desc': [
        '无法依靠祖先遗留的产业而发迹，必须透过自己的奋斗，自置产业，因此在外多所奔波，时起时落难以定身',
        '时买时卖是此天机星类型的特点，即无法同时保有很多的不动产，必须在买进和卖出中才能保有一点田产'
      ],
        '权': '很注重家中摆设',
        '禄': '房子越换越大，有计画性置产',
        '科': '会发心思在布置上',
        '忌': '会为搬家装潢布置伤脑筋',
    },
    '太阳': {
      'desc': [
        '有祖先产业可以继承，但起初虽然兴旺，至晚年时可能荡然无存，必须自己置产才能长存',
        '田宅宫位在寅宫者，您一生都有产业；若在申宫则可能只拥有自己的住宅，而无法求得其他的不动产；若在酉、戌、亥、子、丑各宫的话，则终其身也不会有不动产'
      ],
        '权': '喜欢家中有客人',
        '禄': '先成家后立业，赚钱先买房子，喜与太阴同在田宅',
            '科': '',
        '忌': '男主人操劳，居家注意采光',
    },
    '武曲': {
      'desc': [
        '产业的型式无法固定，或为土地或为房产，或是其他机械设备都无所定论，但总可继续保有',
      ],
        '权': '喜欢坚固耐用之家具家电',
        '禄': '家业守的住，当有钱人机会高',
        '科': '喜欢干爽环境',
        '忌': '家人容易为金钱反目',
    },
    '天同': {
      'desc': [
        '早年不易取得田宅，但天同星晚年时，可以因其他机缘而拥有大批不动产。自己的劳力所获得之田产胜过祖业，田园茂盛',
      ],
        '权': '喜购买高档家具家电',
        '禄': '有机会购买豪宅',
            '科': '',
        '忌': '家中水电容易出问题',
    },
    '廉贞': {
      'desc': [
        '祖先所遗留下来的不动产无法守住，连自己好不容易才得到的不动产，也因环境的冲突，例如修路辟园而丧失',
      ],
        '权': '',
        '禄': '平安，财运不错，限运逢之，有桃花',
            '科': '',
        '忌': '买房子注意产权问题，或为房事起争端兴讼',
    },
    '天府': {
      'desc': [
        '一生中适合在别人的羽翼下、协助之下开展。如果自己独当一面进行大手笔的不动产买卖，一定会遭到破坏',
      ],
    },
    '太阴': {
      'desc': [
        '太阴星主富，因此太阴星在田宅宫的人，有望受不动产之惠而成大富翁',
      ],
        '权': '家中女人掌权',
        '禄': '会有许多不动产，与太阳同宫，更有机会，适合经营不动产',
        '科': '喜欢浪漫的家庭环境',
        '忌': '女主人操劳，居家注意布置',
    },
    '贪狼': {
      'desc': [
        '贪狼星多才多艺因此在各方面都想逞强，在不动产的追求上，有时会发生一些不择手段的情事，常向人贷款买卖不动产，做出自己财力所不及之事，在这种不稳定的状况下，甚至会造成破产的风险，这就是田宅宫持贪狼星的特性',
      ],
        '权': '喜欢将房子布置得很华丽',
        '禄': '喜购买豪华不动产，但须量力，限运逢之，有桃花',
            '科': '',
        '忌': '桃花纠纷多，若本命田宅主一生，若大限田宅主十年',
    },
    '巨门': {
      'desc': [
        '须防因不动产之事而招致的是非口舌',
      ],
        '权': '喜对家人发表意见',
        '禄': '可拥有很大的房子',
            '科': '',
        '忌': '注意家庭之和谐度',
    },
    '天相': {
      'desc': [
        '天相星在诸星中以吉论，可因勤劳而有所收获, 若能劳费心力，必可累积田产',
      ],
        '权': '喜对家人发表意见',
          '禄': '可拥有很大的房子',
            '科': '',
              '忌': '注意家庭之和谐度',
    },
    '天梁': {
      'desc': [
        '一般说来较无产业',
      ],
        '权': '在家中喜掌权',
        '禄': '家中成员相处愉快',
        '科': '晚年安逸',
              '忌': '',
    },
    '七杀': {
      'desc': [
        '七杀星在田宅宫的作用，是造成田宅得失变动性增大的原因, 若宫内有七杀星，将会减损你对产业的取得',
      ],
    },
    '破军': {
      'desc': [
        '具有充分的变化性、破坏性和突出性，因此破军星在田宅宫的人在不动产方面会常有进出',
      ],
        '权': '总是会想装修自己房子, 不满足于现状',
        '禄': '容易冲动拥有大房子，需注意是否有足够预算',
            '科': '',
              '忌': '',
    },
    '左辅': {
      'desc': [
        '虽然不免操劳，却能因操劳而得到成果，在辛勤中所获得的力量，才是最踏实的力量，而这股力量也较容易成就一生的福缘',
      ],
      '科': '喜欢住在文教区',
    },
    '右弼': {
      'desc': [
        '踏实而有力，虽也不免辛劳，但能坦然处之，若有其他吉星同宫，可以发挥其辅佐的力量，成家立业非常容易',
      ],
        '科': '喜欢住在文教区',
    },
    '文昌': {
      'desc': [
        '有才华，富有文艺的气息，这种修养非由天赋，而是经过一番辛苦的历程而得，所以田宅宫持文昌星的人，不免是个辛劳之人，但可确保后来的安逸',
      ],
        '科': '可以承担部分风险去追求利益的最大化',
        '忌': '注意房地产之所有权状及一切凭证，又忌为人担保',
    },
    '文曲': {
      'desc': [
        '有祖业可承',
      ],
        '科': '可以承担部分风险去追求利益的最大化',
          '忌': '注意房地产之所有权状及一切凭证，又忌为人担保',
    },
    '天魁': {
      'desc': [
        '在田宅不动产的处理上，不会和别人发生纠纷，一生中的田产将随着年龄而成正比例的增加',
      ],
    },
    '天钺': {
      'desc': [
        '在不动产的处理干净利落，不会碰到诸如产权不清、权状不明等情事，也不会因不动产之事而发生诉讼之事',
      ],
    },
    '擎羊': {
      'desc': [
        '擎羊星颇具破坏力，对产业不利',
      ],
    },
    '陀罗': {
      'desc': [
        '一生因不动产之事而与他人纠缠不清，麻烦、困扰紧跟下去',
      ],
    },
    '火星': {
      'desc': [
        '火星具有强烈的发散力，因此带有少许破坏力，无论哪一宫位均不佳，所以田宅宫持火星留意散尽祖业',
      ],
    },
    '铃星': {
      'desc': [
        '田宅宫持铃星的人多主祖先所遗留的产业难守',
      ],
    },
    '地空': {
      'desc': [
        '地空星为煞星之一，不利于钱财，多在获得后又失去，所以地空星临田宅宫的人，没有田宅运，一生了无恒产，居无定所',
      ],
    },
    '地劫': {
      'desc': [
        '地劫暗示着不稳定的运程，因此田宅宫持地劫星的人多半只能算是经手房地产，而不能能算是拥有，因为他所拥有的时间是那么短，变动又是那么剧烈',
      ],
    },
    '天马': {
      'desc': [
        '对于田产之事较提不起兴趣，虽然具有充沛的活力，却不使用在不动产的经营之上',
      ],
    },
    '禄存': {
      'desc': [
        '在不动产的经营上有特别的福缘。一生中田产无数，努力可以自置，不动产愈多愈能发挥您管理的才能，而走至旺地',
      ],
    },
  },
  '福德': {
    'desc': '福德宫象征个性、健康、疾病、思想，生活享受的品味，以及物质生活的优劣。福德宫乃推论个人精神修养如何，潜意识个性，兴趣嗜好情形等，财源如何，祖德是否庇荫，命造自身的嗜好、志趣、人生苦乐情形',
    '紫微': {
      'desc': [
        '为人勤勉，凡事关心，又具涵养，交游很广，朋友众多，且深获大众的喜爱与信赖，是一福分丰盈的人',
      ],
        '权': '喜欢过清高幽雅之晚年生活',
          '禄': '',
        '科': '晚年会有子孙相伴',
              '忌': '',
    },
    '天机': {
      'desc': [
        '拥有强烈的求知欲与好奇心，所以对文学、艺术、宗教，甚至未来的一切，均抱有浓厚的兴趣, 所以，年轻时，生活不能安定、平静，一直到中年以后，才有平稳、安乐的日子可言',
      ],
        '权': '喜求知，尤其是宗教，哲学，五术方面',
        '禄': '懂得安排晚年生活，喜宗教哲学',
        '科': '晚年有机会接触宗教',
        '忌': '晚年忧郁，宜有宗教信仰',
    },
    '太阳': {
      'desc': [
        '做事积极卖力，所以生活非常的忙禄。虽然如此，但不能因这样就认定您劳命奔波，辛苦操劳。相反的，您的福分丰盛异常，尤其是坐巳、午两宫位，更是明显',
        '女性更是大吉，必可受福德之赐，终生洋溢在幸福美满的生活情趣中'
      ],
        '权': '晚年喜社交，好交友',
        '禄': '精神面貌很好，也主晚年乐观安于生活',
            '科': '',
        '忌': '晚年注意脾气不好',
    },
    '武曲': {
      'desc': [
        '个性急躁顽固，所以一生多操劳少收获，可谓事倍功半，也因而在生活上很难享有快乐、怡悦的日子',
      ],
        '权': '晚年掌财，是小器财神',
        '禄': '晚年不缺钱财',
        '科': '晚年掌财，会照顾子女',
        '忌': '晚年多疑，不安全感',
    },
    '天同': {
      'desc': [
        '待人接物非常的世故，并且先天的福分丰盛，即使遇有相尚的困难亦能化解，故而您一生都是在顺遂、愉快而幸福的气氛中度过，是一享福终身的人',
      ],
        '权': '养生有道，长寿',
        '禄': '懂得生活情趣，尤其禄最适合入福德宫，主长寿有福可享',
            '科': '',
        '忌': '晚年多病，注意养生',
    },
    '廉贞': {
      'desc': [
        '个性善变而不稳，且天生劳禄命，所以必需在忙禄奔波的工作中，才可感觉到人生的意义与价值。倘若肯勤勉稳重的力争上游，必有改观的一天',
      ],
        '权': '',
        '禄': '好享受，懂得生活情调',
            '科': '',
        '忌': '晚年注意情绪，易吃莫名其妙的醋',
    },
    '天府': {
      'desc': [
        '多才多艺，乐天知命，所以能享受到每一分每一秒的欢乐时光。必可使人长命百岁，怡悦一生',
      ],
    },
    '太阴': {
      'desc': [
        '思想浪漫、博学多能，福德永临，所以整个人生都在福德所赠宁静、安逸、快乐的生活中度过',
      ],
        '权': '老来俏，晚年有异性缘',
        '禄': '福德照财帛，主存得进钱财',
        '科': '老来俏，晚年有异性缘',
        '忌': '晚年注意孤僻，不跟子女交往',
    },
    '贪狼': {
      'desc': [
        '福分淡薄，若无主星、吉星同宫辅助，必无法享一欢乐的人生。然而言都是你不安现状，祈求过多所致，所以你毫无抱怨的权力',
      ],
        '权': '晚年有口福，也指临老入花丛',
        '禄': '长寿，身体健康',
            '科': '老来俏，晚年有异性缘',
        '忌': '晚年注意肾疾，阳痿，女命注意妇科',
    },
    '巨门': {
      'desc': [
        '劳命奔波而无所收获，总是徒劳无功',
      ],
        '权': '晚年放不下名利，过份执着',
          '禄': '有口福, 饮食上从不会亏待自己',
            '科': '老来俏，晚年有异性缘',
        '忌': '晚年无口福，忌吃油腻大鱼大肉，以免影响健康',
    },
    '天相': {
      'desc': [
        '福运强盛，寿算高长，所以一辈子都在舒适、安逸、令人羡慕的日子中过日子。天相星入庙坐福德宫，主人长命百寿，愉悦一生',
      ],
        '权': '晚年放不下名利，过份执着',
          '禄': '有口福, 饮食上从不会亏待自己',
            '科': '老来俏，晚年有异性缘',
              '忌': '晚年无口福，忌吃油腻大鱼大肉，以免影响健康',
    },
    '天梁': {
      'desc': [
        '不适合当一风头人物，否则您做任何事都不能如意，无法顺遂。但若以次要立场出现，必能获得照顾，可望功成名就，愉悦的度过人生',
        '天梁星坐福德宫入庙，必能享受一辈子的欢乐、幸福。并且，可以使人长命百寿'
      ],
        '权': '喜欢晚辈恭维，也指晚年喜欢进修',
        '禄': '长寿，身体健康',
            '科': '',
        '忌': '喜欢照顾晚辈，也只晚年有子孙相伴',
    },
    '七杀': {
      'desc': [
        '七杀星在福德宫暗示着您将拥有一个怀禄而辛劳的人生。一生中以工作为主，无论对自己或他人都要求严苛，因此造成内心的不平衡，是自寻烦恼的类型',
        '女性，若无其他诸星在位的话，贞操观念较薄弱，容易沦入风尘，反应其劳苦一生之特性'
      ],
    },
    '破军': {
      'desc': [
        '将遭到一生奔忙的命运，虽然日日勉力于工作却不见收获的到来。而且日日烦躁，心理上无法平静下来',
        '女性，若无其他诸星在位的话，贞操观念较薄弱，容易沦入风尘，反应其劳苦一生之特性'
      ],
        '权': '喜欢奢靡享受',
        '禄': '好享受，喜高消费生活',
            '科': '',
              '忌': '',
    },
    '左辅': {
      'desc': [
        '喜于参加社会交际活动，但生活上很安定，不会常常迁移，是某个区域内的领导人物',
        '一生享福，日日欢乐，多能抱持着乐观的态度，容易和大家相处而得到人和，对自己一生有很大的助益'
      ],
        '科': '晚年会有很好的社交生活',
    },
    '右弼': {
      'desc': [
        '非常热心于社会性活动的人，譬如义演活动、社区性的合唱团等文艺活动，以及带有教育性质的社工活动等，您都会是一个出色的成员',
      ],
        '科': '晚年会有很好的社交生活',
    },
    '文昌': {
      'desc': [
        '快乐而有福的人，一生求福而得福、求乐而得乐, 必须辛勤一生，在辛勤的同时追求自己的兴趣',
        '文昌星主才华，若无他星同坐一宫位，多主其人文质彬彬，口能言善道，天资颖悟，而且具有文学方面的修养'
      ],
        '权': '',
          '禄': '',
        '科': '晚年对哲学有兴趣',
        '忌': '晚年烦躁，喜依老卖老，恐惹人嫌',
    },
    '文曲': {
      'desc': [
        '文曲星亦为文星之一，主文学才艺的涵养，福德宫持文曲星，因此具有强烈的感受力，对任何事物观察入微，而且拥有非常敏锐的感触力',
        '若遇子、亥宫位时，可以安稳度过一生，而且在精神或实利上都有所获, 若居寅宫位，无论男、女在感情生活上都会有不如意的情事产生，尤其是女性，极可能是在结婚和离婚的反覆过程中过完此生'
      ],
        '权': '',
          '禄': '',
            '科': '晚年对哲学有兴趣',
              '忌': '晚年烦躁，喜依老卖老，恐惹人嫌',
    },
    '天魁': {
      'desc': [
        '一生中自有贵人相助，时常在不知不觉中助您逢凶化吉，求学、求职无不一顺，无论在任何行业都能独树一帜，而有所成就',
      ],
    },
    '天钺': {
      'desc': [
        '一生享福，快乐而且清闲',
      ],
    },
    '擎羊': {
      'desc': [
        '宜多和大众接触，若独守安命，恐难终其身',
      ],
    },
    '陀罗': {
      'desc': [
        '一生麻烦不断，为工作而忙禄不堪，食衣住行虽不匮虞，却没有乐观的时刻',
      ],
    },
    '火星': {
      'desc': [
        '一生中不免于辛劳，但只要肯用劳力，辛勤耕耘自然会得到福分。宜多方行善，否则有短命之虞',
      ],
    },
    '铃星': {
      'desc': [
        '此人性情刚烈，一生劳苦，又无法出人头地',
      ],
    },
    '地空': {
      'desc': [
        '将因钱财之事而屡受打击。地空星独坐福德宫，不善言词，不喜与人交往，性格多变，情绪多样化',
      ],
    },
    '地劫': {
      'desc': [
        '一生运程不定，就因财与情的得失，而造成心境上的不平衡',
      ],
    },
    '天马': {
      'desc': [
        '一生将会过着一种旅行再旅行的生活，从小时候的到外地求学，至长大时的到他处谋职，一直是带着变化的色彩',
        '适合久居一处，否则会造成心理上的不平衡，因为它的特性就是在奔动旅行中达到舒适的精神状态'
      ],
    },
    '禄存': {
      'desc': [
        '必是个高寿之人，具有非常坚强的意志，能够克服困难、突破危机而获得一生幸福的保证',
        '男性在事业上有冲劲，早年多劳苦，晚年必可享安乐, 女性随着年龄的增加愈显出她的美德在晚年成为受到敬重的长者'
      ],
},
  },
  '父母': {
    'desc': '父母宫主与父母的感情厚薄，父母对自己的影响，缘份强弱，有没有父母庇荫，遗产，父母个性或父母的社会背景等。也象征个人的相貌、健康状况。也代表与上司互动或政府关系如何',
    '紫微': {
      'desc': [
        '自己与双亲的亲情，甚为融洽，并且基于父母亲在社会上拥有自己的事业，无论在成就、名位、声望等各方面，足以令远近亲邻所推崇',
        '身为其儿女者，生活在此优越的环境庇护下，无论在精神方面，或物质方面，皆能受到充分的满足与享受'
      ],
        '权': '父母高贵，得父母之助，反而会影响独立性',
          '禄': '',
        '科': '与父母感情不错',
              '忌': '',
    },
    '天机': {
      'desc': [
        '父母和蔼可亲，平易近人，对您的养育也呵护备至，所以常造成您对他们不耐烦，嫌他们唠叨的情形出现',
        '如果天机星入庙，则有父母的呵护，但因自己独立性强，无依赖性，所以容易忽略了父母亲对您的照顾'
      ],
        '权': '父母精明能干',
        '禄': '长辈缘，偏男性长辈',
        '科': '父母明理',
        '忌': '与父母理念不合',
    },
    '太阳': {
      'desc': [
        '双亲心地善良，为人忠厚，在情感方面也能自然的表露出来，所以您们之间没有任何的隐瞒、欺骗，也没有所谓的「代沟」出现',
        '由于与父母亲接触频繁，所以在各方面您受双亲的影响很深，尤其是受父亲的影响，更是具体而显的'
      ],
        '权': '父亲较霸道',
        '禄': '父缘较深',
            '科': '',
        '忌': '与父亲较无缘，或父亲管教严格',
    },
    '武曲': {
      'desc': [
        '双亲个性稳重，行事谨慎，并且对子女的管教非常的严厉、顽固，然而他们明知您内心的烦闷、病苦，但基于面子问题，望子成龙望女成凤的心理，他们还是相当固持己见',
        '由于与父母亲接触频繁，所以在各方面您受双亲的影响很深，尤其是受父亲的影响，更是具体而显的'
      ],
        '权': '父母掌权财',
        '禄': '父母会赚钱',
        '科': '父母会留财产',
        '忌': '父母脾气不好',
    },
    '天同': {
      'desc': [
        '双亲慈祥、和蔼、亲切又理智，故而家庭洋溢着温馨的气氛',
      ],
        '权': '父母福寿',
        '禄': '父母照顾',
            '科': '',
        '忌': '父母操劳，不懂享福，或健康有损',
    },
    '廉贞': {
      'desc': [
        '父母双亲虽对子女的养育、管教极具用心，要求亦严，但其急躁、为所欲为的个性却难以克制的暴露无遗, 所以，从小您与双亲间的感情就很不容易协调，因而冲突不断，更因您双亲可能有赌博的恶习，因此导致您离乡背井，外出奋斗，过着远离双亲的生活',
      ],
        '权': '',
        '禄': '长辈缘，且异性长辈更深',
            '科': '',
        '忌': '父母管教情绪化，或父母年轻风流',
    },
    '天府': {
      'desc': [
        '家庭环境富裕。此外，您的双亲待人和气、性情持重、处事公平，对您的教养也是温和而适中的，所以您与父母间的感情是真挚而深厚的',
      ],
    },
    '太阴': {
      'desc': [
        '受到母亲的影响很强烈。并且，因您父母对子女的反应观察入微，照顾得无微不至，所以您的家庭处处充满了温馨、和谐',
      ],
        '权': '',
        '禄': '母亲缘较深厚',
        '科': '与母亲感情较深',
        '忌': '与母亲较缘薄，或家教严格',
    },
    '贪狼': {
      'desc': [
        '与父母亲的感情淡薄，形同陌路，若远走他乡，离开父母，或许还有补救的希望。否则，您虽然有形的物质方面富足允裕，但在无形的生活上却倍受煎熬，尝尽孤单、寂寞的滋味',
      ],
        '权': '父母精神爽朗',
        '禄': '父母高寿',
            '科': '',
        '忌': '父母风流，或不切实际',
    },
    '巨门': {
      'desc': [
        '双亲重视物质上的生活，并且对子女苛刻，要求过高，所以在这样的双亲教导下，您的各方面均受到强烈的震撼和改变，影响很深',
      ],
        '权': '父母有口舌，家庭气氛不佳',
        '禄': '与父母之间基本没啥隔阂或代沟',
            '科': '',
        '忌': '与父母有代沟',
    },
    '天相': {
      'desc': [
        '拥有明理、应变的双亲，所以在父母的呵护及长辈的宠爱中，度过一愉快的人生。并且，您可从父母的教导中，得到一些为人处世的技巧，受父母亲的影响很深',
      ],
    },
    '天梁': {
      'desc': [
        '拥有一对活泼、健朗、善良而又心细的双亲。并且，您的父亲是一深具责任感的人，所以是整个家庭的中心',
        '父母感情和谐，是一对人见人羡的好夫妻，即使您长大了，也是打从心里的佩服他们，根本无法脱离双亲而独立，故而您受父母亲的影响很大'
      ],
        '权': '父母有权威，也主您很敬畏父母',
        '禄': '父母很疼爱你',
        '科': '得父母照顾',
              '忌': '',
    },
    '七杀': {
      'desc': [
        '拥有一对固执而又霸道，凡事要绝对服从的双亲，所以您们两代之间的鸿沟很深，永远对立。并且，七杀星是凶星，主孤独，所以您在早年时候，就可能与双亲分离，自己在外独立',
      ],
    },
    '破军': {
      'desc': [
        '父母争执不断、意见不一，所以您的家庭没有一般人和谐、温馨',
      ],
        '权': '幼儿期得父母照顾，父母也很强势',
        '禄': '父母比较自我',
            '科': '',
              '忌': '',
    },
    '左辅': {
      'desc': [
        '您因父母的关系与长辈的交情颇佳，因此在一生的运势中，受长辈的支持、帮助很多',
      ],
        '科': '与父母关系如同朋友',
    },
    '右弼': {
      'desc': [
        '您因父母的关系与长辈的交情颇佳，因此在一生的运势中，受长辈的支持、帮助很多',
      ],
        '科': '与父母关系如同朋友',
    },
    '文昌': {
      'desc': [
        '父母在文、艺方面研究很深，颇具艺术、美感的领悟力。因此受到双亲的感化，对文学、艺术等方面的鉴赏，颇有兴趣，所以双亲的生活方向，理想目标都与您有极大的共同点，故而您们两代间没有任何的纠纷、争执或瓜葛在',
      ],
        '科': '得遗产机会大',
        '忌': '独立性强不靠父母遗产',
    },
    '文曲': {
      'desc': [
        '双亲反应灵敏又具修养，对生活情趣也颇重视，并且在社会的交际也很广泛。对您生长的过程很有帮助，所以从小就在这优秀，脱颖环境中成长的您，自然而然的循着父母的路线发展，受父母的影响很大',
      ],
        '科': '得遗产机会大',
          '忌': '独立性强不靠父母遗产',
    },
    '天魁': {
      'desc': [
        '您因父母人际关系广泛，受父母庇荫佷多，于是在长辈中来往自如，交情甚笃，因此在您一生运势中，若有不畅或不快时，必得父母的支助，使您化险为夷，转危为安，顺遂的过一辈子',
      ],
    },
    '天钺': {
      'desc': [
        '双亲对您的影响、福荫很深。并且，天钺星是一颗贵人星，所以您的人生旅程中，若遇挫折或危机时，都可得到父母直接或间接的帮助，使您安然度过危机',
      ],
    },
    '擎羊': {
      'desc': [
        '擎羊星坐父母宫位中，幼年刑克，不是与父母生离死别，就是双亲之一，健康状况不佳，危险很大',
      ],
    },
    '陀罗': {
      'desc': [
        '陀罗星坐父母宫者，皆主幼年刑克，若非与父母亲分离出外独立，就是与父母亲黄泉永别，再不就是双亲中，有一位身体情况很差，一生都在疾病、病痛中度过',
      ],
    },
    '火星': {
      'desc': [
        '双亲对您的影响、福荫很深。并且，天钺星是一颗贵人星，所以您的人生旅程中，若遇挫折或危机时，都可得到父母直接或间接的帮助，使您安然度过危机',
      ],
    },
    '铃星': {
      'desc': [
        '双亲对您的影响、福荫很深。并且，天钺星是一颗贵人星，所以您的人生旅程中，若遇挫折或危机时，都可得到父母直接或间接的帮助，使您安然度过危机',
      ],
    },
    '地空': {
      'desc': [
        '您的家境并不理想，同时您与双亲间的缘分也很淡薄，总是一东一西、一南一北的，碰面、相聚的时间很短',
      ],
    },
    '地劫': {
      'desc': [
        '您的生活环境不其理想，父母给您的物质享受亦处处显得欠缺、贫乏',
      ],
    },
    '天马': {
      'desc': [
        '您与双亲缘分不佳，所以常有一方出外，碰面机会很少, 此外，您与双亲相聚的机会不多，缘份薄弱',
      ],
    },
    '禄存': {
      'desc': [
        '您家庭生活环境富足，物质生活享受不缺，受父母庇荫很多，即使是将来在事业的开发、拓展上，亦可受到家庭的支授与协助，在生活、前途各方面，依赖父母、仰靠父母的地方很多。一般说来禄存星坐父母宫者，必生活在安逸、富足的环境中，并且不与父母刑克',
      ],
    },
  }
}